ChibiOS/ChibiOS/os/hal/ports/STM32/STM32U3xx/hal_lld.h
/*
    ChibiOS - Copyright (C) 2006..2018 Giovanni Di Sirio

    Licensed under the Apache License, Version 2.0 (the "License");
    you may not use this file except in compliance with the License.
    You may obtain a copy of the License at

        http://www.apache.org/licenses/LICENSE-2.0

    Unless required by applicable law or agreed to in writing, software
    distributed under the License is distributed on an "AS IS" BASIS,
    WITHOUT WARRANTIES OR CONDITIONS OF ANY KIND, either express or implied.
    See the License for the specific language governing permissions and
    limitations under the License.
*/

/**
 * @file    STM32H5xx/hal_lld.h
 * @brief   STM32H5xx HAL subsystem low level driver header.
 * @pre     This module requires the following macros to be defined in the
 *          @p board.h file:
 *          - STM32_LSECLK.
 *          - STM32_LSEDRV.
 *          - STM32_LSE_BYPASS (optionally).
 *          - STM32_HSECLK.
 *          - STM32_HSE_BYPASS (optionally).
 *          - STM32_HSE_DIGITAL (optionally).
 *          .
 *          One of the following macros must also be defined:
 *          - STM32U375xx, STM32U385xx.
 *          .
 *
 * @addtogroup HAL
 * @{
 */

#ifndef HAL_LLD_H
#define HAL_LLD_H

#include "stm32_registry.h"

/*===========================================================================*/
/* Driver constants.                                                         */
/*===========================================================================*/

/**
 * @brief   Requires use of SPIv2 driver model.
 */
#define HAL_LLD_SELECT_SPI_V2           TRUE

/**
 * @name    Platform identification
 * @{
 */
#if defined(STM32U375xx) || defined(__DOXYGEN__)
  #define PLATFORM_NAME         "STM32U3 Low-power"

#elif defined(STM32U385xx)
  #define PLATFORM_NAME         "STM32U3 Low-power with Crypto"

#else
  #error "STM32U3 device not specified"
#endif

/**
 * @brief   Sub-family identifier.
 */
#if !defined(STM32U5XX) || defined(__DOXYGEN__)
  #define STM32U5XX
#endif
/** @} */

/**
 * @name   Clock points names
 * @{
 */
#define CLK_HSI                 0U
#define CLK_CSI                 1U
#define CLK_HSI48               2U
#define CLK_HSE                 3U
#define CLK_MSIS                4U
#define CLK_MSIK                5U
#define CLK_SYSCLK              6U
#define CLK_HCLK                7U
#define CLK_PCLK1               8U
#define CLK_PCLK1TIM            9U
#define CLK_PCLK2               10U
#define CLK_PCLK2TIM            11U
#define CLK_PCLK3               12U
#define CLK_MCO1                13U
#define CLK_MCO2                14U
#define CLK_ARRAY_SIZE          15U
/** @} */

/**
 * @name    MSIRC0 96MHz oscillator settings
 * @{
 */
#define STM32_MSIRC0_FREE       0
#define STM32_MSIRC0_PLL_LSE    1
#define STM32_MSIRC0_PLL_HSE    2
/** @} */

/**
 * @name    MSIRC1 24MHz oscillator settings
 * @{
 */
#define STM32_MSIRC1_FREE       0
#define STM32_MSIRC1_PLL_LSE    1
#define STM32_MSIRC1_PLL_HSE    2
/** @} */

/**
 * @name    Source and divider for MSIS
 * @{
 */
#define STM32_MSIS_IRC0_DIV1    0       /* 96MHz */
#define STM32_MSIS_IRC0_DIV2    1       /* 48MHz */
#define STM32_MSIS_IRC0_DIV4    2       /* 24MHz */
#define STM32_MSIS_IRC0_DIV8    3       /* 12MHz */
#define STM32_MSIS_IRC1_DIV1    4       /* ~24MHz */
#define STM32_MSIS_IRC1_DIV3    5       /* ~12MHz */
#define STM32_MSIS_IRC1_DIV4    6       /* ~6MHz */
#define STM32_MSIS_IRC1_DIV8    7       /* ~4MHz */
/** @} */

/**
 * @name    Source and divider for MSIK
 * @{
 */
#define STM32_MSIK_IRC0_DIV1    0       /* 96MHz */
#define STM32_MSIK_IRC0_DIV2    1       /* 48MHz */
#define STM32_MSIK_IRC0_DIV4    2       /* 24MHz */
#define STM32_MSIK_IRC0_DIV8    3       /* 12MHz */
#define STM32_MSIK_IRC1_DIV1    4       /* ~24MHz */
#define STM32_MSIK_IRC1_DIV3    5       /* ~12MHz */
#define STM32_MSIK_IRC1_DIV4    6       /* ~6MHz */
#define STM32_MSIK_IRC1_DIV8    7       /* ~4MHz */
/** @} */

/**
 * @name    PWR_CR3 register definitions
 * @{
 */
#define STM32_REGSEL            (1U << PWR_CR3_REGSEL_Pos)

#define STM32_FSTEN             (1U << PWR_CR3_FSTEN_Pos)
/** @} */

/**
 * @name    PWR_VOSR register definitions
 * @{
 */
#define STM32_VOS_POS           0
#define STM32_VOS_MASK          (3U << 0)
#define STM32_VOS_RANGE1        (1U << PWR_VOSR_R1EN_Pos)
#define STM32_VOS_RANGE2        (1U << PWR_VOSR_R2EN_Pos)

#define STM32_BOOSTEN           (1U << PWR_VOSR_BOOSTEN_Pos)

#define STM32_R1RDY             (1U << PWR_VOSR_R1RDY_Pos)

#define STM32_R2RDY             (1U << PWR_VOSR_R2RDY_Pos)

#define STM32_BOOSTRDY          (1U << PWR_VOSR_BOOSTRDY_Pos)
/** @} */

/**
 * @name    FLASH_ACR register bits definitions
 * @{
 */
#define STM32_LATENCY_POS       FLASH_ACR_LATENCY_Pos
#define STM32_LATENCY_MASK      FLASH_ACR_LATENCY_Msk
#define STM32_LATENCY_FIELD(n)  ((n) << STM32_LATENCY_POS)
#define STM32_LATENCY_0         STM32_LATENCY_FIELD(0U)
#define STM32_LATENCY_1         STM32_LATENCY_FIELD(1U)
#define STM32_LATENCY_2         STM32_LATENCY_FIELD(2U)
#define STM32_LATENCY_3         STM32_LATENCY_FIELD(3U)
#define STM32_LATENCY_4         STM32_LATENCY_FIELD(4U)

#define STM32_PRFTEN            FLASH_ACR_PRFTEN
#define STM32_LPM               FLASH_ACR_LPM
#define STM32_PDREQ1            FLASH_ACR_PDREQ1
#define STM32_PDREQ2            FLASH_ACR_PDREQ2
#define STM32SLEEP_PD           FLASH_ACR_SLEEP_PD
/** @} */

/**
 * @name    RCC_CFGR1 register bits definitions
 * @{
 */
#define STM32_SW_POS            RCC_CFGR1_SW_Pos
#define STM32_SW_MASK           RCC_CFGR1_SW_Msk
#define STM32_SW_FIELD(n)       ((n) << STM32_SW_POS)
#define STM32_SW_MSIS           STM32_SW_FIELD(0U)
#define STM32_SW_HSI16          STM32_SW_FIELD(1U)
#define STM32_SW_HSE            STM32_SW_FIELD(2U)

#define STM32_SWS_POS           RCC_CFGR1_SWS_Pos
#define STM32_SWS_MASK          RCC_CFGR1_SWS_Msk
#define STM32_SWS_FIELD(n)      ((n) << STM32_SWS_POS)
#define STM32_SWS_MSIS          STM32_SWS_FIELD(0U)
#define STM32_SWS_HSI16         STM32_SWS_FIELD(1U)
#define STM32_SWS_HSE           STM32_SWS_FIELD(2U)

#define STM32_STOPWUCK_POS      RCC_CFGR1_STOPWUCK_Pos
#define STM32_STOPWUCK_MASK     RCC_CFGR1_STOPWUCK_Msk
#define STM32_STOPWUCK_FIELD(n) ((n) << STM32_STOPWUCK_POS)
#define STM32_STOPWUCK_HSI      STM32_STOPWUCK_FIELD(0U)
#define STM32_STOPWUCK_CSI      STM32_STOPWUCK_FIELD(1U)

#define STM32_STOPKERWUCK_POS   RCC_CFGR1_STOPKERWUCK_Pos
#define STM32_STOPKERWUCK_MASK  RCC_CFGR1_STOPKERWUCK_Msk
#define STM32_STOPKERWUCK_FIELD(n) ((n) << STM32_STOPKERWUCK_POS)
#define STM32_STOPKERWUCK_HSI   STM32_STOPKERWUCK_FIELD(0U)
#define STM32_STOPKERWUCK_CSI   STM32_STOPKERWUCK_FIELD(1U)

#define STM32_MCO1SEL_POS       RCC_CFGR1_MCO1SEL_Pos
#define STM32_MCO1SEL_MASK      RCC_CFGR1_MCO1SEL_Msk
#define STM32_MCO1SEL_FIELD(n)  ((n) << STM32_MCO1SEL_POS)
#define STM32_MCO1SEL_OFF       STM32_MCO1PRE_FIELD(0U)
#define STM32_MCO1SEL_SYSCLK    STM32_MCO1PRE_FIELD(1U)
#define STM32_MCO1SEL_MSIS      STM32_MCO1PRE_FIELD(2U)
#define STM32_MCO1SEL_HSI16     STM32_MCO1PRE_FIELD(3U)
#define STM32_MCO1SEL_HSE       STM32_MCO1PRE_FIELD(4U)
#define STM32_MCO1SEL_LSI       STM32_MCO1PRE_FIELD(5U)
#define STM32_MCO1SEL_LSE       STM32_MCO1PRE_FIELD(6U)
#define STM32_MCO1SEL_HSI48     STM32_MCO1PRE_FIELD(7U)
#define STM32_MCO1SEL_MSIK      STM32_MCO1PRE_FIELD(8U)

#define STM32_MCO1PRE_POS       RCC_CFGR1_MCO1PRE_Pos
#define STM32_MCO1PRE_MASK      RCC_CFGR1_MCO1PRE_Msk
#define STM32_MCO1PRE_FIELD(n)  ((n) << STM32_MCO1PRE_POS)
#define STM32_MCO1PRE_DIV1      STM32_MCO1PRE_FIELD(0U)
#define STM32_MCO1PRE_DIV2      STM32_MCO1PRE_FIELD(1U)
#define STM32_MCO1PRE_DIV4      STM32_MCO1PRE_FIELD(2U)
#define STM32_MCO1PRE_DIV8      STM32_MCO1PRE_FIELD(3U)
#define STM32_MCO1PRE_DIV16     STM32_MCO1PRE_FIELD(4U)
#define STM32_MCO1PRE_DIV32     STM32_MCO1PRE_FIELD(5U)
#define STM32_MCO1PRE_DIV64     STM32_MCO1PRE_FIELD(6U)
#define STM32_MCO1PRE_DIV128    STM32_MCO1PRE_FIELD(7U)

#define STM32_MCO2SEL_POS       RCC_CFGR1_MCO2SEL_Pos
#define STM32_MCO2SEL_MASK      RCC_CFGR1_MCO2SEL_Msk
#define STM32_MCO2SEL_FIELD(n)  ((n) << STM32_MCO2SEL_POS)
#define STM32_MCO2SEL_OFF       STM32_MCO2PRE_FIELD(0U)
#define STM32_MCO2SEL_SYSCLK    STM32_MCO2PRE_FIELD(1U)
#define STM32_MCO2SEL_MSIS      STM32_MCO2PRE_FIELD(2U)
#define STM32_MCO2SEL_HSI16     STM32_MCO2PRE_FIELD(3U)
#define STM32_MCO2SEL_HSE       STM32_MCO2PRE_FIELD(4U)
#define STM32_MCO2SEL_LSI       STM32_MCO2PRE_FIELD(5U)
#define STM32_MCO2SEL_LSE       STM32_MCO2PRE_FIELD(6U)
#define STM32_MCO2SEL_HSI48     STM32_MCO2PRE_FIELD(7U)
#define STM32_MCO2SEL_MSIK      STM32_MCO2PRE_FIELD(8U)

#define STM32_MCO2PRE_POS       RCC_CFGR1_MCO2PRE_Pos
#define STM32_MCO2PRE_MASK      RCC_CFGR1_MCO2PRE_Msk
#define STM32_MCO2PRE_FIELD(n)  ((n) << STM32_MCO2PRE_POS)
#define STM32_MCO2PRE_DIV1      STM32_MCO2PRE_FIELD(0U)
#define STM32_MCO2PRE_DIV2      STM32_MCO2PRE_FIELD(1U)
#define STM32_MCO2PRE_DIV4      STM32_MCO2PRE_FIELD(2U)
#define STM32_MCO2PRE_DIV8      STM32_MCO2PRE_FIELD(3U)
#define STM32_MCO2PRE_DIV16     STM32_MCO2PRE_FIELD(4U)
#define STM32_MCO2PRE_DIV32     STM32_MCO2PRE_FIELD(5U)
#define STM32_MCO2PRE_DIV64     STM32_MCO2PRE_FIELD(6U)
#define STM32_MCO2PRE_DIV128    STM32_MCO2PRE_FIELD(7U)
/** @} */

/**
 * @name    RCC_CFGR2 register bits definitions
 * @{
 */
#define STM32_HPRE_POS          RCC_CFGR2_HPRE_Pos
#define STM32_HPRE_MASK         RCC_CFGR2_HPRE_Msk
#define STM32_HPRE_FIELD(n)     ((n) << STM32_HPRE_POS)
#define STM32_HPRE_DIV1         STM32_HPRE_FIELD(0U)
#define STM32_HPRE_DIV2         STM32_HPRE_FIELD(8U)
#define STM32_HPRE_DIV4         STM32_HPRE_FIELD(9U)
#define STM32_HPRE_DIV8         STM32_HPRE_FIELD(10U)
#define STM32_HPRE_DIV16        STM32_HPRE_FIELD(11U)
#define STM32_HPRE_DIV64        STM32_HPRE_FIELD(12U)
#define STM32_HPRE_DIV128       STM32_HPRE_FIELD(13U)
#define STM32_HPRE_DIV256       STM32_HPRE_FIELD(14U)
#define STM32_HPRE_DIV512       STM32_HPRE_FIELD(15U)

#define STM32_PPRE1_POS         RCC_CFGR2_PPRE1_Pos
#define STM32_PPRE1_MASK        RCC_CFGR2_PPRE1_Msk
#define STM32_PPRE1_FIELD(n)    ((n) << STM32_PPRE1_POS)
#define STM32_PPRE1_DIV1        STM32_PPRE1_FIELD(0U)
#define STM32_PPRE1_DIV2        STM32_PPRE1_FIELD(4U)
#define STM32_PPRE1_DIV4        STM32_PPRE1_FIELD(5U)
#define STM32_PPRE1_DIV8        STM32_PPRE1_FIELD(6U)
#define STM32_PPRE1_DIV16       STM32_PPRE1_FIELD(7U)

