ChibiOS/ChibiOS/os/hal/ports/STM32/STM32U3xx/hal_lld.h
#define STM32_PPRE2_POS         RCC_CFGR2_PPRE2_Pos
#define STM32_PPRE2_MASK        RCC_CFGR2_PPRE2_Msk
#define STM32_PPRE2_FIELD(n)    ((n) << STM32_PPRE2_POS)
#define STM32_PPRE2_DIV1        STM32_PPRE2_FIELD(0U)
#define STM32_PPRE2_DIV2        STM32_PPRE2_FIELD(4U)
#define STM32_PPRE2_DIV4        STM32_PPRE2_FIELD(5U)
#define STM32_PPRE2_DIV8        STM32_PPRE2_FIELD(6U)
#define STM32_PPRE2_DIV16       STM32_PPRE2_FIELD(7U)
/** @} */

/**
 * @name    RCC_CFGR3 register bits definitions
 * @{
 */
#define STM32_PPRE3_POS         RCC_CFGR3_PPRE3_Pos
#define STM32_PPRE3_MASK        RCC_CFGR3_PPRE3_Msk
#define STM32_PPRE3_FIELD(n)    ((n) << STM32_PPRE3_POS)
#define STM32_PPRE3_DIV1        STM32_PPRE3_FIELD(0U)
#define STM32_PPRE3_DIV2        STM32_PPRE3_FIELD(4U)
#define STM32_PPRE3_DIV4        STM32_PPRE3_FIELD(5U)
#define STM32_PPRE3_DIV8        STM32_PPRE3_FIELD(6U)
#define STM32_PPRE3_DIV16       STM32_PPRE3_FIELD(7U)
/** @} */

/**
 * @name    RCC_CFGR4 register bits definitions
 * @{
 */
#define STM32_BOOSTSEL_POS      RCC_CFGR4_BOOSTSEL_Pos
#define STM32_BOOSTSEL_MASK     RCC_CFGR4_BOOSTSEL_Msk
#define STM32_BOOSTSEL_FIELD(n) ((n) << STM32_BOOSTSEL_POS)
#define STM32_BOOSTSEL_NOCLOCK  STM32_BOOSTSEL_FIELD(0U)
#define STM32_BOOSTSEL_MSIS     STM32_BOOSTSEL_FIELD(1U)
#define STM32_BOOSTSEL_HSI16    STM32_BOOSTSEL_FIELD(2U)
#define STM32_BOOSTSEL_HSE      STM32_BOOSTSEL_FIELD(3U)

#define STM32_BOOSTDIV_POS      RCC_CFGR4_BOOSTDIV_Pos
#define STM32_BOOSTDIV_MASK     RCC_CFGR4_BOOSTDIV_Msk
#define STM32_BOOSTDIV_FIELD(n) ((n) << STM32_BOOSTDIV_POS)
#define STM32_BOOSTDIV_DIV1     STM32_BOOSTDIV_FIELD(0U)
#define STM32_BOOSTDIV_DIV2     STM32_BOOSTDIV_FIELD(1U)
#define STM32_BOOSTDIV_DIV4     STM32_BOOSTDIV_FIELD(2U)
#define STM32_BOOSTDIV_DIV6     STM32_BOOSTDIV_FIELD(3U)
#define STM32_BOOSTDIV_DIV8     STM32_BOOSTDIV_FIELD(4U)
#define STM32_BOOSTDIV_DIV10    STM32_BOOSTDIV_FIELD(5U)
#define STM32_BOOSTDIV_DIV12    STM32_BOOSTDIV_FIELD(6U)
#define STM32_BOOSTDIV_DIV14    STM32_BOOSTDIV_FIELD(7U)
#define STM32_BOOSTDIV_DIV16    STM32_BOOSTDIV_FIELD(8U)
/** @} */

/**
 * @name    RCC_CCIPR1 register bits definitions
 * @{
 */
#define STM32_USART1SEL_POS     0
#define STM32_USART1SEL_MASK    (1U << STM32_USART1SEL_POS)
#define STM32_USART1SEL_FIELD(n) ((n) << STM32_USART1SEL_POS)
#define STM32_USART1SEL_PCLK2   STM32_USART1SEL_FIELD(0U)
#define STM32_USART1SEL_HSI16   STM32_USART1SEL_FIELD(1U)

#define STM32_USART3SEL_POS     2
#define STM32_USART3SEL_MASK    (1U << STM32_USART3SEL_POS)
#define STM32_USART3SEL_FIELD(n) ((n) << STM32_USART3SEL_POS)
#define STM32_USART3SEL_PCLK1   STM32_USART1SEL_FIELD(0U)
#define STM32_USART3SEL_HSI16   STM32_USART1SEL_FIELD(1U)

#define STM32_UART4SEL_POS      4
#define STM32_UART4SEL_MASK     (1U << STM32_UART4SEL_POS)
#define STM32_UART4SEL_FIELD(n) ((n) << STM32_UART4SEL_POS)
#define STM32_UART4SEL_PCLK1    STM32_UART4SEL_FIELD(0U)
#define STM32_UART4SEL_HSI16    STM32_UART4SEL_FIELD(1U)

#define STM32_UART5SEL_POS      6
#define STM32_UART5SEL_MASK     (1U << STM32_UART5SEL_POS)
#define STM32_UART5SEL_FIELD(n) ((n) << STM32_UART5SEL_POS)
#define STM32_UART5SEL_PCLK1    STM32_UART5SEL_FIELD(0U)
#define STM32_UART5SEL_HSI16    STM32_UART5SEL_FIELD(1U)

#define STM32_I3C1SEL_POS       8
#define STM32_I3C1SEL_MASK      (1U << STM32_I3C1SEL_POS)
#define STM32_I3C1SEL_FIELD(n)  ((n) << STM32_I3C1SEL_POS)
#define STM32_I3C1SEL_PCLK1     STM32_I3C1SEL_FIELD(0U)
#define STM32_I3C1SEL_MSIK      STM32_I3C1SEL_FIELD(1U)

#define STM32_I2C1SEL_POS       10
#define STM32_I2C1SEL_MASK      (1U << STM32_I2C1SEL_POS)
#define STM32_I2C1SEL_FIELD(n)  ((n) << STM32_I2C1SEL_POS)
#define STM32_I2C1SEL_PCLK1     STM32_I2C1SEL_FIELD(0U)
#define STM32_I2C1SEL_MSIK      STM32_I2C1SEL_FIELD(1U)

#define STM32_I2C2SEL_POS       12
#define STM32_I2C2SEL_MASK      (1U << STM32_I2C2SEL_POS)
#define STM32_I2C2SEL_FIELD(n)  ((n) << STM32_I2C2SEL_POS)
#define STM32_I2C2SEL_PCLK1     STM32_I2C2SEL_FIELD(0U)
#define STM32_I2C2SEL_MSIK      STM32_I2C2SEL_FIELD(1U)

#define STM32_I3C2SEL_POS       14
#define STM32_I3C2SEL_MASK      (1U << STM32_I3C2SEL_POS)
#define STM32_I3C2SEL_FIELD(n)  ((n) << STM32_I3C2SEL_POS)
#define STM32_I3C2SEL_PCLK3     STM32_I3C2SEL_FIELD(0U)
#define STM32_I3C2SEL_MSIK      STM32_I3C2SEL_FIELD(1U)

#define STM32_SPI2SEL_POS       16
#define STM32_SPI2SEL_MASK      (1U << STM32_SPI2SEL_POS)
#define STM32_SPI2SEL_FIELD(n)  ((n) << STM32_SPI2SEL_POS)
#define STM32_SPI2SEL_PCLK1     STM32_SPI2SEL_FIELD(0U)
#define STM32_SPI2SEL_MSIK      STM32_SPI2SEL_FIELD(1U)

#define STM32_LPTIM2SEL_POS     18
#define STM32_LPTIM2SEL_MASK    (3U << STM32_LPTIM2SEL_POS)
#define STM32_LPTIM2SEL_FIELD(n) ((n) << STM32_LPTIM2SEL_POS)
#define STM32_LPTIM2SEL_PCLK1   STM32_LPTIM2SEL_FIELD(0U)
#define STM32_LPTIM2SEL_LSI     STM32_LPTIM2SEL_FIELD(1U)
#define STM32_LPTIM2SEL_HSI16   STM32_LPTIM2SEL_FIELD(2U)
#define STM32_LPTIM2SEL_LSE     STM32_LPTIM2SEL_FIELD(3U)

#define STM32_SPI1SEL_POS       20
#define STM32_SPI1SEL_MASK      (1U << STM32_SPI1SEL_POS)
#define STM32_SPI1SEL_FIELD(n)  ((n) << STM32_SPI1SEL_POS)
#define STM32_SPI1SEL_PCLK2     STM32_SPI1SEL_FIELD(0U)
#define STM32_SPI1SEL_MSIK      STM32_SPI1SEL_FIELD(1U)

#define STM32_SYSTICKSEL_POS    22
#define STM32_SYSTICKSEL_MASK   (3U << STM32_SYSTICKSEL_POS)
#define STM32_SYSTICKSEL_FIELD(n) ((n) << STM32_SYSTICKSEL_POS)
#define STM32_SYSTICKSEL_HCLKDIV8 STM32_SYSTICKSEL_FIELD(0U)
#define STM32_SYSTICKSEL_LSI    STM32_SYSTICKSEL_FIELD(1U)
#define STM32_SYSTICKSEL_LSE    STM32_SYSTICKSEL_FIELD(2U)

#define STM32_FDCAN1SEL_POS     24
#define STM32_FDCAN1SEL_MASK    (1U << STM32_FDCAN1SEL_POS)
#define STM32_FDCAN1SEL_FIELD(n) ((n) << STM32_FDCAN1SEL_POS)
#define STM32_FDCAN1SEL_IGNORE  0xFFFFFFFFU
#define STM32_FDCAN1SEL_SYSCLK  STM32_FDCAN1SEL_FIELD(0U)
#define STM32_FDCAN1SEL_MSIK    STM32_FDCAN1SEL_FIELD(1U)

#define STM32_ICLKSEL_POS       26
#define STM32_ICLKSEL_MASK      (3U << STM32_ICLKSEL_POS)
#define STM32_ICLKSEL_FIELD(n)  ((n) << STM32_ICLKSEL_POS)
#define STM32_ICLKSEL_HSI48     STM32_ICLKSEL_FIELD(0U)
#define STM32_ICLKSEL_MSIK      STM32_ICLKSEL_FIELD(1U)
#define STM32_ICLKSEL_HSE       STM32_ICLKSEL_FIELD(2U)
#define STM32_ICLKSEL_SYSCLK    STM32_ICLKSEL_FIELD(3U)

#define STM32_USB1SEL_POS       28
#define STM32_USB1SEL_MASK      (1U << STM32_USB1SEL_POS)
#define STM32_USB1SEL_FIELD(n)  ((n) << STM32_USB1SEL_POS)
#define STM32_USB1SEL_ICLK      STM32_USB1SEL_FIELD(0U)
#define STM32_USB1SEL_ICLKDIV2  STM32_USB1SEL_FIELD(1U)

