ChibiOS/ChibiOS/os/hal/ports/STM32/STM32U3xx/hal_lld.h
#define STM32_TIMICSEL_POS      29
#define STM32_TIMICSEL_MASK     (7U << STM32_TIMICSEL_POS)
#define STM32_TIMICSEL_FIELD(n) ((n) << STM32_TIMICSEL_POS)
#define STM32_TIMICSEL_NOCLOCK                  STM32_TIMICSEL_FIELD(0U)
#define STM32_TIMICSEL_HSI256_MSIS1024_MSIS4    STM32_TIMICSEL_FIELD(4U)
#define STM32_TIMICSEL_HSI256_MSIS1024_MSIK4    STM32_TIMICSEL_FIELD(5U)
#define STM32_TIMICSEL_HSI256_MSIK1024_MSIS4    STM32_TIMICSEL_FIELD(6U)
#define STM32_TIMICSEL_HSI256_MSIK1024_MSIK4    STM32_TIMICSEL_FIELD(7U)
/** @} */

/**
 * @name    RCC_CCIPR2 register bits definitions
 * @{
 */

#define STM32_ADF1SEL_POS       0
#define STM32_ADF1SEL_MASK      (3U << STM32_ADF1SEL_POS)
#define STM32_ADF1SEL_FIELD(n)  ((n) << STM32_ADF1SEL_POS)
#define STM32_ADF1SEL_HCLK      STM32_ADF1SEL_FIELD(0U)
#define STM32_ADF1SEL_AUDIOCLK  STM32_ADF1SEL_FIELD(1U)
#define STM32_ADF1SEL_HSE       STM32_ADF1SEL_FIELD(2U)

#define STM32_SPI3SEL_POS       3
#define STM32_SPI3SEL_MASK      (1U << STM32_SPI3SEL_POS)
#define STM32_SPI3SEL_FIELD(n)  ((n) << STM32_SPI3SEL_POS)
#define STM32_SPI3SEL_PCLK1     STM32_SPI3SEL_FIELD(0U)
#define STM32_SPI3SEL_MSIK      STM32_SPI3SEL_FIELD(1U)

#define STM32_SAI1SEL_POS       5
#define STM32_SAI1SEL_MASK      (3U << STM32_SAI1SEL_POS)
#define STM32_SAI1SEL_FIELD(n)  ((n) << STM32_SAI1SEL_POS)
#define STM32_SAI1SEL_MSIK      STM32_SAI1SEL_FIELD(0U)
#define STM32_SAI1SEL_AUDIOCLK  STM32_SAI1SEL_FIELD(1U)
#define STM32_SAI1SEL_HSE       STM32_SAI1SEL_FIELD(2U)

#define STM32_RNGSEL_POS        11
#define STM32_RNGSEL_MASK       (1U << STM32_RNGSEL_POS)
#define STM32_RNGSEL_FIELD(n)   ((n) << STM32_RNGSEL_POS)
#define STM32_RNGSEL_IGNORE     0xFFFFFFFFU
#define STM32_RNGSEL_HSI48      STM32_RNGSEL_FIELD(0U)
#define STM32_RNGSEL_MSIK       STM32_RNGSEL_FIELD(1U)

#define STM32_ADCDACPRE_POS     12
#define STM32_ADCDACPRE_MASK    (15U << STM32_ADCDACPRE_POS)
#define STM32_ADCDACPRE_FIELD(n) ((n) << STM32_ADCDACPRE_POS)
#define STM32_ADCDACPRE_ICLK        STM32_ADCDACPRE_FIELD(0U)
#define STM32_ADCDACPRE_ICLKDIV2    STM32_ADCDACPRE_FIELD(1U)
#define STM32_ADCDACPRE_ICLKDIV4    STM32_ADCDACPRE_FIELD(8U)
#define STM32_ADCDACPRE_ICLKDIV8    STM32_ADCDACPRE_FIELD(9U)
#define STM32_ADCDACPRE_ICLKDIV16   STM32_ADCDACPRE_FIELD(10U)
#define STM32_ADCDACPRE_ICLKDIV32   STM32_ADCDACPRE_FIELD(11U)
#define STM32_ADCDACPRE_ICLKDIV64   STM32_ADCDACPRE_FIELD(12U)
#define STM32_ADCDACPRE_ICLKDIV128  STM32_ADCDACPRE_FIELD(13U)
#define STM32_ADCDACPRE_ICLKDIV256  STM32_ADCDACPRE_FIELD(14U)
#define STM32_ADCDACPRE_ICLKDIV512  STM32_ADCDACPRE_FIELD(15U)

#define STM32_ADCDACSEL_POS     16
#define STM32_ADCDACSEL_MASK    (3U << STM32_ADCDACSEL_POS)
#define STM32_ADCDACSEL_FIELD(n) ((n) << STM32_ADCDACSEL_POS)
#define STM32_ADCDACSEL_HCLK    STM32_ADCDACSEL_FIELD(0U)
#define STM32_ADCDACSEL_HSE     STM32_ADCDACSEL_FIELD(1U)
#define STM32_ADCDACSEL_MSIK    STM32_ADCDACSEL_FIELD(2U)

#define STM32_DAC1SHSEL_POS     19
#define STM32_DAC1SHSEL_MASK    (1U << STM32_DAC1SHSEL_POS)
#define STM32_DAC1SHSEL_FIELD(n) ((n) << STM32_DAC1SHSEL_POS)
#define STM32_DAC1SHSEL_LSE     STM32_DAC1SHSEL_FIELD(0U)
#define STM32_DAC1SHSEL_LSI     STM32_DAC1SHSEL_FIELD(1U)

#define STM32_OCTOSPISEL_POS    20
#define STM32_OCTOSPISEL_MASK   (3U << STM32_OCTOSPISEL_POS)
#define STM32_OCTOSPISEL_FIELD(n) ((n) << STM32_OCTOSPISEL_POS)
#define STM32_OCTOSPISEL_SYSCLK STM32_OCTOSPISEL_FIELD(0U)
#define STM32_OCTOSPISEL_MSIK   STM32_OCTOSPISEL_FIELD(1U)
/** @} */

/**
 * @name    RCC_CCIPR3 register bits definitions
 * @{
 */
#define STM32_LPUART1SEL_POS    0
#define STM32_LPUART1SEL_MASK   (3U << STM32_LPUART1SEL_POS)
#define STM32_LPUART1SEL_FIELD(n) ((n) << STM32_LPUART1SEL_POS)
#define STM32_LPUART1SEL_PCLK3  STM32_LPUART1SEL_FIELD(0U)
#define STM32_LPUART1SEL_HSI16  STM32_LPUART1SEL_FIELD(1U)
#define STM32_LPUART1SEL_LSE    STM32_LPUART1SEL_FIELD(2U)
#define STM32_LPUART1SEL_MSIK   STM32_LPUART1SEL_FIELD(3U)

#define STM32_I2C3SEL_POS       6
#define STM32_I2C3SEL_MASK      (1U << STM32_I2C3SEL_POS)
#define STM32_I2C3SEL_FIELD(n)  ((n) << STM32_I2C3SEL_POS)
#define STM32_I2C3SEL_PCLK3     STM32_I2C3SEL_FIELD(0U)
#define STM32_I2C3SEL_MSIK      STM32_I2C3SEL_FIELD(1U)

#define STM32_LPTIM34SEL_POS    8
#define STM32_LPTIM34SEL_MASK   (3U << STM32_LPTIM34SEL_POS)
#define STM32_LPTIM34SEL_FIELD(n) ((n) << STM32_LPTIM34SEL_POS)
#define STM32_LPTIM34SEL_MSIK   STM32_LPTIM34SEL_FIELD(0U)
#define STM32_LPTIM34SEL_LSI    STM32_LPTIM34SEL_FIELD(1U)
#define STM32_LPTIM34SEL_HSI16  STM32_LPTIM34SEL_FIELD(2U)
#define STM32_LPTIM34SEL_LSE    STM32_LPTIM34SEL_FIELD(3U)

#define STM32_LPTIM1SEL_POS     10
#define STM32_LPTIM1SEL_MASK    (3U << STM32_LPTIM1SEL_POS)
#define STM32_LPTIM1SEL_FIELD(n) ((n) << STM32_LPTIM1SEL_POS)
#define STM32_LPTIM1SEL_MSIK    STM32_LPTIM1SEL_FIELD(0U)
#define STM32_LPTIM1SEL_LSI     STM32_LPTIM1SEL_FIELD(1U)
#define STM32_LPTIM1SEL_HSI16   STM32_LPTIM1SEL_FIELD(2U)
#define STM32_LPTIM1SEL_LSE     STM32_LPTIM1SEL_FIELD(3U)
/** @} */

/**
 * @name    RCC_BDCR register bits definitions
 * @{
 */
#define STM32_RTCSEL_POS        8
#define STM32_RTCSEL_MASK       (3U << STM32_RTCSEL_POS)
#define STM32_RTCSEL_FIELD(n)   ((n) << STM32_RTCSEL_POS)
#define STM32_RTCSEL_NOCLOCK    STM32_RTCSEL_FIELD(0U)
#define STM32_RTCSEL_LSE        STM32_RTCSEL_FIELD(1U)
#define STM32_RTCSEL_LSI        STM32_RTCSEL_FIELD(2U)
#define STM32_RTCSEL_HSEDIV     STM32_RTCSEL_FIELD(3U)

#define STM32_LSCOSEL_POS       24
#define STM32_LSCOSEL_MASK      (3U << STM32_LSCOSEL_POS)
#define STM32_LSCOSEL_FIELD(n)  ((n) << STM32_LSCOSEL_POS)
#define STM32_LSCOSEL_NOCLOCK   STM32_LSCOSEL_FIELD(0U)
#define STM32_LSCOSEL_LSE       STM32_LSCOSEL_FIELD(1U)
#define STM32_LSCOSEL_LSI       STM32_LSCOSEL_FIELD(3U)
/** @} */

/*===========================================================================*/
/* Driver pre-compile time settings.                                         */
/*===========================================================================*/

/**
 * @name    Configuration options
 * @{
 */
/**
 * @brief   Disables the PWR/RCC initialization in the HAL.
 */
#if !defined(STM32_NO_INIT) || defined(__DOXYGEN__)
#define STM32_NO_INIT                       FALSE
#endif

/**
 * @brief   Enables the dynamic clock handling.
 */
#if !defined(STM32_CLOCK_DYNAMIC) || defined(__DOXYGEN__)
#define STM32_CLOCK_DYNAMIC                 FALSE
#endif

/**
 * @brief   PWR CR3 register initialization value.
 */
#if !defined(STM32_PWR_CR3) || defined(__DOXYGEN__)
#define STM32_PWR_CR3
#endif

/**
 * @brief   PWR VOSR register initialization value.
 */
#if !defined(STM32_PWR_VOSR) || defined(__DOXYGEN__)
#define STM32_PWR_VOSR                      STM32_VOS_RANGE1
#endif

/**
 * @brief   PWR WUCR1 register initialization value.
 */
#if !defined(STM32_PWR_WUCR1) || defined(__DOXYGEN__)
#define STM32_PWR_WUCR1                     (0U)
#endif

/**
 * @brief   PWR WUCR2 register initialization value.
 */
#if !defined(STM32_PWR_WUCR2) || defined(__DOXYGEN__)
#define STM32_PWR_WUCR2                     (0U)
#endif

/**
 * @brief   PWR WUCR3 register initialization value.
 */
#if !defined(STM32_PWR_WUCR3) || defined(__DOXYGEN__)
#define STM32_PWR_WUCR3                     (0U)
#endif

/**
 * @brief   PWR BDCR register initialization value.
 */
#if !defined(STM32_PWR_BDCR) || defined(__DOXYGEN__)
#define STM32_PWR_BDCR                      (0U)
#endif

/**
 * @brief   PWR SECCFGR register initialization value.
 */
#if !defined(STM32_PWR_SECCFGR) || defined(__DOXYGEN__)
#define STM32_PWR_SECCFGR                   (0U)
#endif

/**
 * @brief   PWR PRIVCFGR register initialization value.
 */
#if !defined(STM32_PWR_PRIVCFGR) || defined(__DOXYGEN__)
#define STM32_PWR_PRIVCFGR                  (0U)

/**
 * @brief   PWR APCR register initialization value.
 */
#if !defined(STM32_PWR_APCR) || defined(__DOXYGEN__)
#define STM32_PWR_APCR                      (0U)
#endif

/**
 * @brief   PWR PUCRA register initialization value.
 */
#if !defined(STM32_PWR_PUCRA) || defined(__DOXYGEN__)
#define STM32_PWR_PUCRA                     (0U)
#endif

/**
 * @brief   PWR PDCRA register initialization value.
 */
#if !defined(STM32_PWR_PDCRA) || defined(__DOXYGEN__)
#define STM32_PWR_PDCRA                     (0U)
#endif

/**
 * @brief   PWR PUCRB register initialization value.
 */
#if !defined(STM32_PWR_PUCRB) || defined(__DOXYGEN__)
#define STM32_PWR_PUCRB                     (0U)
#endif

/**
 * @brief   PWR PDCRB register initialization value.
 */
#if !defined(STM32_PWR_PDCRB) || defined(__DOXYGEN__)
#define STM32_PWR_PDCRB                     (0U)
#endif

/**
 * @brief   PWR PUCRC register initialization value.
 */
#if !defined(STM32_PWR_PUCRC) || defined(__DOXYGEN__)
#define STM32_PWR_PUCRC                     (0U)
#endif

/**
 * @brief   PWR PDCRC register initialization value.
 */
#if !defined(STM32_PWR_PDCRC) || defined(__DOXYGEN__)
#define STM32_PWR_PDCRC                     (0U)
#endif

/**
 * @brief   PWR PUCRD register initialization value.
 */
#if !defined(STM32_PWR_PUCRD) || defined(__DOXYGEN__)
#define STM32_PWR_PUCRD                     (0U)
#endif

/**
 * @brief   PWR PDCRD register initialization value.
 */
#if !defined(STM32_PWR_PDCRD) || defined(__DOXYGEN__)
#define STM32_PWR_PDCRD                     (0U)
#endif

/**
 * @brief   PWR PUCRE register initialization value.
 */
#if !defined(STM32_PWR_PUCRE) || defined(__DOXYGEN__)
#define STM32_PWR_PUCRE                     (0U)
#endif

/**
 * @brief   PWR PDCRE register initialization value.
 */
#if !defined(STM32_PWR_PDCRE) || defined(__DOXYGEN__)
#define STM32_PWR_PDCRE                     (0U)
#endif

/**
 * @brief   PWR PUCRG register initialization value.
 */
#if !defined(STM32_PWR_PUCRG) || defined(__DOXYGEN__)
#define STM32_PWR_PUCRG                     (0U)
#endif

/**
 * @brief   PWR PDCRG register initialization value.
 */
#if !defined(STM32_PWR_PDCRG) || defined(__DOXYGEN__)
#define STM32_PWR_PDCRG                     (0U)
#endif

/**
 * @brief   PWR PUCRH register initialization value.
 */
#if !defined(STM32_PWR_PUCRH) || defined(__DOXYGEN__)
#define STM32_PWR_PUCRH                     (0U)
#endif

/**
 * @brief   PWR PDCRH register initialization value.
 */
#if !defined(STM32_PWR_PDCRH) || defined(__DOXYGEN__)
#define STM32_PWR_PDCRH                     (0U)
#endif

/**
 * @brief   PWR I3CPUCR1 register initialization value.
 */
#if !defined(STM32_PWR_I3CPUCR1) || defined(__DOXYGEN__)
#define STM32_PWR_I3CPUCR1                  (0U)
#endif

/**
 * @brief   PWR I3CPUCR2 register initialization value.
 */
#if !defined(STM32_PWR_I3CPUCR1) || defined(__DOXYGEN__)
#define STM32_PWR_I3CPUCR2                  (0U)
#endif

/**
 * @brief   FLASH ACR register initialization value.
 * @note    Do not specify the LATENCY bits because those are calculated
 *          depending on other settings and ORed to this value.
 */
#if !defined(STM32_ACR_VALUE) || defined(__DOXYGEN__)
#define STM32_ACR_VALUE                     (FLASH_ACR_PRFTEN)
#endif

/**
 * @brief   Enables or disables the HSI clock source.
 */
#if !defined(STM32_HSI_ENABLED) || defined(__DOXYGEN__)
#define STM32_HSI_ENABLED                   TRUE
#endif

/**
 * @brief   Enables or disables the HSI clock source in STOP mode.
 */
#if !defined(STM32_HSIKERON_ENABLED) || defined(__DOXYGEN__)
#define STM32_HSIKERON_ENABLED              TRUE
#endif

/**
 * @brief   Enables or disables the HSI48 clock source.
 */
#if !defined(STM32_HSI48_ENABLED) || defined(__DOXYGEN__)
#define STM32_HSI48_ENABLED                 FALSE
#endif

/**
 * @brief   Enables or disables the HSE clock source.
 */
#if !defined(STM32_HSE_ENABLED) || defined(__DOXYGEN__)
#define STM32_HSE_ENABLED                   FALSE
#endif

/**
 * @brief   Enables or disables the LSI clock source.
 */
#if !defined(STM32_LSI_ENABLED) || defined(__DOXYGEN__)
#define STM32_LSI_ENABLED                   FALSE
#endif

/**
 * @brief   Enables or disables the LSE clock source.
 */
#if !defined(STM32_LSE_ENABLED) || defined(__DOXYGEN__)
#define STM32_LSE_ENABLED                   FALSE
#endif

/**
 * @brief   Mode of the MSIRC0 96MHz clock source.
 * @note    It affects bits in various registers.
 */
#if !defined(STM32_MSIRC0_MODE) || defined(__DOXYGEN__)
#define STM32_MSIRC0_MODE                   STM32_MSIRC0_PLL_LSE
#endif

/**
 * @brief   Enables or disables the MSIRC1 24MHz clock source.
 * @note    It affects bits in various registers.
 */
#if !defined(STM32_MSIRC1_MODE) || defined(__DOXYGEN__)
#define STM32_MSIRC1_MODE                   STM32_MSIRC1_PLL_LSE
#endif

/**
 * @brief   MSIRC1 PLL correction factors.
 * @details Valid values are 0, 2 and 3 which correspond to slightly
 *          different frequencies when MSIRC1 is used as source, frequencies
 *          are in MHz:
 *          - 0 LSE: 23.986, 11.993, 5.997, 2.998.
 *          - 2 LSE: 22.577, 11.289, 5.644, 2.822.
 *          - 3 LSE: 24.576, 12.288, 6.144, 3.072.
 *          - 0 HSE: 24.016, 12.008, 6.004, 3.002.
 *          - 2 HSE: 22.581, 11.290, 5.645, 2.823.
 *          - 3 HSE: 24.577, 12.289, 6.144, 3.072.
 *          .
 * @note    MSIRC1 does not allow for round numbers, source from MSIRC0 to
 *          obtain precise 96MHz, 48MHz, 24MHz, 12MHz frequencies.
 */
#if !defined(STM32_MSIPLL1N_VALUE) || defined(__DOXYGEN__)
#define STM32_MSIPLL1N_VALUE                0
#endif

/**
 * @brief   Source and divide factor for MSIS.
 */
#if !defined(STM32_MSIS_SRCDIV) || defined(__DOXYGEN__)
#define STM32_MSIS_SRCDIV                   STM32_MSIS_IRC0_DIV1
#endif

/**
 * @brief   Source and divide factor for MSIK.
 */
#if !defined(STM32_MSIK_SRCDIV) || defined(__DOXYGEN__)
#define STM32_MSIK_SRCDIV                   STM32_MSIK_IRC0_DIV1
#endif

/**
 * @brief   PLL bias enable.
 * @note    Power reduction in STOP modes but reduced accuracy.
 */
#if !defined(STM32_MSIBIAS_ENABLED) || defined(__DOXYGEN__)
#define STM32_MSIBIAS_ENABLED               FALSE
#endif

/**
 * @brief   MSI range selection on STANDBY/SHUTDOWN exit.
 */
#if !defined(STM32_MSIRGSEL_ENABLED) || defined(__DOXYGEN__)
#define STM32_MSIRGSEL_ENABLED              FALSE
#endif

/**
 * @brief   Main clock source selection.
 */
#if !defined(STM32_SW) || defined(__DOXYGEN__)
#define STM32_SW                            STM32_SW_MSIS
#endif

/**
 * @brief   AHB prescaler value.
 */
#if !defined(STM32_HPRE) || defined(__DOXYGEN__)
#define STM32_HPRE                          STM32_HPRE_DIV1
#endif

/**
 * @brief   APB1 prescaler value.
 */
#if !defined(STM32_PPRE1) || defined(__DOXYGEN__)
#define STM32_PPRE1                         STM32_PPRE1_DIV1
#endif

/**
 * @brief   APB2 prescaler value.
 */
#if !defined(STM32_PPRE2) || defined(__DOXYGEN__)
#define STM32_PPRE2                         STM32_PPRE2_DIV1
#endif

/**
 * @brief   APB3 prescaler value.
 */
#if !defined(STM32_PPRE3) || defined(__DOXYGEN__)
#define STM32_PPRE3                         STM32_PPRE3_DIV1
#endif

/**
 * @brief   System clock source after STOP.
 */
#if !defined(STM32_STOPWUCK) || defined(__DOXYGEN__)
#define STM32_STOPWUCK                      STM32_STOPWUCK_HSI
#endif

/**
 * @brief   Kernel clock source after STOP.
 */
#if !defined(STM32_STOPKERWUCK) || defined(__DOXYGEN__)
#define STM32_STOPKERWUCK                   STM32_STOPKERWUCK_HSI
#endif

/**
 * @brief   MCO1 clock source.
 */
#if !defined(STM32_MCO1SEL) || defined(__DOXYGEN__)
#define STM32_MCO1SEL                       STM32_MCO1SEL_HSI
#endif

/**
 * @brief   MCO1 divider setting.
 */
#if !defined(STM32_MCO1PRE_VALUE) || defined(__DOXYGEN__)
#define STM32_MCO1PRE_VALUE                 STM32_MCO1PRE_NOCLOCK
#endif

/**
 * @brief   MCO2 clock source.
 */
#if !defined(STM32_MCO2SEL) || defined(__DOXYGEN__)
#define STM32_MCO2SEL                       STM32_MCO2SEL_SYSCLK
#endif

/**
 * @brief   MCO1 divider setting.
 */
#if !defined(STM32_MCO2PRE_VALUE) || defined(__DOXYGEN__)
#define STM32_MCO2PRE_VALUE                 STM32_MCO2PRE_NOCLOCK
#endif

/**
 * @brief   LSCO clock source.
 */
#if !defined(STM32_LSCOSEL) || defined(__DOXYGEN__)
#define STM32_LSCOSEL                       STM32_LSCOSEL_NOCLOCK
#endif

/**
 * @brief   TIMICSEL clock source.
 */
#if !defined(STM32_TIMICSEL) || defined(__DOXYGEN__)
#define STM32_TIMICSEL                      STM32_TIMICSEL_NOCLK
#endif

/**
 * @brief   USART1 clock source.
 */
#if !defined(STM32_USART1SEL) || defined(__DOXYGEN__)
#define STM32_USART1SEL                     STM32_USART1SEL_PCLK2
#endif

/**
 * @brief   USART3 clock source.
 */
#if !defined(STM32_USART3SEL) || defined(__DOXYGEN__)
#define STM32_USART3SEL                     STM32_USART3SEL_PCLK1
#endif

/**
 * @brief   UART4 clock source.
 */
#if !defined(STM32_UART4SEL) || defined(__DOXYGEN__)
#define STM32_UART4SEL                      STM32_UART4SEL_PCLK1
#endif

/**
 * @brief   UART5 clock source.
 */
#if !defined(STM32_UART5SEL) || defined(__DOXYGEN__)
#define STM32_UART5SEL                      STM32_UART5SEL_PCLK1
#endif

/**
 * @brief   LPUART1 clock source.
 */
#if !defined(STM32_LPUART1SEL) || defined(__DOXYGEN__)
#define STM32_LPUART1SEL                    STM32_LPUART1SEL_PCLK3
#endif

/**
 * @brief   LPTIM1 clock source.
 */
#if !defined(STM32_LPTIM1SEL) || defined(__DOXYGEN__)
#define STM32_LPTIM1SEL                     STM32_LPTIM1SEL_PCLK3
#endif

/**
 * @brief   LPTIM2 clock source.
 */
#if !defined(STM32_LPTIM2SEL) || defined(__DOXYGEN__)
#define STM32_LPTIM2SEL                     STM32_LPTIM2SEL_PCLK1
#endif

/**
 * @brief   LPTIM34 clock source.
 */
#if !defined(STM32_LPTIM34SEL) || defined(__DOXYGEN__)
#define STM32_LPTIM34SEL                    STM32_LPTIM34SEL_PCLK3
#endif

/**
 * @brief   SPI1 clock source.
 */
#if !defined(STM32_SPI1SEL) || defined(__DOXYGEN__)
#define STM32_SPI1SEL                       STM32_SPI1SEL_PCLK2
#endif

/**
 * @brief   SPI2 clock source.
 */
#if !defined(STM32_SPI2SEL) || defined(__DOXYGEN__)
#define STM32_SPI2SEL                       STM32_SPI2SEL_PCLK1
#endif

/**
 * @brief   SPI3 clock source.
 */
#if !defined(STM32_SPI3SEL) || defined(__DOXYGEN__)
#define STM32_SPI3SEL                       STM32_SPI3SEL_PCLK1
#endif

/**
 * @brief   OCTOSPI clock source.
 */
#if !defined(STM32_OCTOSPISEL) || defined(__DOXYGEN__)
#define STM32_OCTOSPISEL                    STM32_OSPISEL_SYSCLK
#endif

/**
 * @brief   SYSTICK clock source.
 */
#if !defined(STM32_SYSTICKSEL) || defined(__DOXYGEN__)
#define STM32_SYSTICKSEL                    STM32_SYSTICKSEL_HCLKDIV8
#endif

/**
 * @brief   SDMMC1 clock source.
 */
#if !defined(STM32_ICLKSEL) || defined(__DOXYGEN__)
#define STM32_ICLKSEL                       STM32_ICLKSEL_SYSCLK
#endif

/**
 * @brief   USB1 clock source.
 */
#if !defined(STM32_USB1SEL) || defined(__DOXYGEN__)
#define STM32_USB1SEL                       STM32_USB1SEL_ICLKDIV2
#endif

/**
 * @brief   I2C1 clock source.
 */
#if !defined(STM32_I2C1SEL) || defined(__DOXYGEN__)
#define STM32_I2C1SEL                       STM32_I2C1SEL_PCLK1
#endif

/**
 * @brief   I2C2 clock source.
 */
#if !defined(STM32_I2C2SEL) || defined(__DOXYGEN__)
#define STM32_I2C2SEL                       STM32_I2C2SEL_PCLK1
#endif

/**
 * @brief   I2C3 clock source.
 */
#if !defined(STM32_I2C3SEL) || defined(__DOXYGEN__)
#define STM32_I2C3SEL                       STM32_I2C3SEL_PCLK3
#endif

/**
 * @brief   I3C1 clock source.
 */
#if !defined(STM32_I3C1SEL) || defined(__DOXYGEN__)
#define STM32_I3C1SEL                       STM32_I3C1SEL_PCLK1
#endif

/**
 * @brief   I3C2 clock source.
 */
#if !defined(STM32_I3C2SEL) || defined(__DOXYGEN__)
#define STM32_I3C2SEL                       STM32_I3C2SEL_PCLK3
#endif

/**
 * @brief   ADCDACSEL clock source.
 */
#if !defined(STM32_ADCDACSEL) || defined(__DOXYGEN__)
#define STM32_ADCDACSEL                     STM32_ADCDACSEL_HCLK
#endif

/**
 * @brief   DAC1SEL clock source.
 */
#if !defined(STM32_DAC1SEL) || defined(__DOXYGEN__)
#define STM32_DAC1SEL                       STM32_DAC1SEL_LSE
#endif

/**
 * @brief   ADCDACPRE clock source.
 */
#if !defined(STM32_ADCDACPRE) || defined(__DOXYGEN__)
#define STM32_ADCDACPRE                     STM32_ADCDACPRE_ICLK
#endif

/**
 * @brief   RNG clock source.
 */
#if !defined(STM32_RNGSEL) || defined(__DOXYGEN__)
#define STM32_RNGSEL                        STM32_RNGSEL_HSI48
#endif

/**
 * @brief   FDCAN1 clock source.
 */
#if !defined(STM32_FDCAN1SEL) || defined(__DOXYGEN__)
#define STM32_FDCAN1SEL                     STM32_FDCAN1SEL_SYSCLK
#endif

/**
 * @brief   SAI1 clock source.
 */
#if !defined(STM32_SAI1SEL) || defined(__DOXYGEN__)
#define STM32_SAI1SEL                       STM32_SAI1SEL_MSIK
#endif

/**
 * @brief   ADF1 clock source.
 */
#if !defined(STM32_ADF1SEL) || defined(__DOXYGEN__)
#define STM32_ADF1SEL                       STM32_ADF1SEL_HCLK
#endif

/**
 * @brief   RTC clock source.
 */
#if !defined(STM32_RTCSEL) || defined(__DOXYGEN__)
#define STM32_RTCSEL                        STM32_RTCSEL_NOCLOCK
#endif
/** @} */

/*===========================================================================*/
/* Derived constants and error checks.                                       */
/*===========================================================================*/

/* Clock handling mode selection.*/
#if STM32_CLOCK_DYNAMIC == TRUE
#define HAL_LLD_USE_CLOCK_MANAGEMENT
#endif

