ChibiOS/ChibiOS/os/hal/ports/STM32/STM32U3xx/hal_lld.h
/*
 * Configuration-related checks.
 */
#if !defined(STM32U3xx_MCUCONF)
#error "Using a wrong mcuconf.h file, STM32H5xx_MCUCONF not defined"
#endif

#if defined(STM32U375xx) && !defined(STM32U375_MCUCONF)
#error "Using a wrong mcuconf.h file, STM32U375_MCUCONF not defined"

#elif defined(STM32U385xx) && !defined(STM32U385_MCUCONF)
#error "Using a wrong mcuconf.h file, STM32U385_MCUCONF not defined"

#endif

/* Device limits.*/
#include "stm32_limits.h"

/* ICache handler.*/
#include "stm32_icache.inc"

/* Clock handlers.*/
#include "stm32_lsi.inc"
#include "stm32_csi.inc"
#include "stm32_hsi48.inc"
#include "stm32_hsidiv.inc"
#include "stm32_lse.inc"
#include "stm32_hse.inc"

/*
 * MSIS enable check.
 */
#if (STM32_SW           == STM32_SW_MSIS)           ||                      \
    (STM32_MCO1SEL      == STM32_MCO1SEL_MSIS)      ||                      \
    (STM32_MCO2SEL      == STM32_MCO2SEL_MSIS)      ||                      \
    defined(__DOXYGEN__)
  /**
   * @brief   PLL1 activation flag.
   */
  #define STM32_ACTIVATE_MSIS       TRUE
#else

  #define STM32_ACTIVATE_MSIS       FALSE
#endif

/*
 * MSIK enable check.
 */
#if (STM32_MCO1SEL      == STM32_MCO1SEL_MSIK)      ||                      \
    (STM32_MCO2SEL      == STM32_MCO2SEL_MSIK)      ||                      \
    (STM32_LPUART1SEL   == STM32_LPUART1SEL_MSIK)   ||                      \
    (STM32_LPTIM1SEL    == STM32_LPTIM1SEL_MSIK)    ||                      \
    (STM32_LPTIM2SEL    == STM32_LPTIM2SEL_MSIK)    ||                      \
    (STM32_LPTIM34SEL   == STM32_LPTIM34SEL_MSIK)   ||                      \
    (STM32_SPI1SEL      == STM32_SPI1SEL_MSIK)      ||                      \
    (STM32_SPI2SEL      == STM32_SPI2SEL_MSIK)      ||                      \
    (STM32_SPI3SEL      == STM32_SPI3SEL_MSIK)      ||                      \
    (STM32_I2C1SEL      == STM32_I2C1SEL_MSIK)      ||                      \
    (STM32_I2C2SEL      == STM32_I2C2SEL_MSIK)      ||                      \
    (STM32_I2C3SEL      == STM32_I2C3SEL_MSIK)      ||                      \
    (STM32_I3C1SEL      == STM32_I3C1SEL_MSIK)      ||                      \
    (STM32_I3C2SEL      == STM32_I3C2SEL_MSIK)      ||                      \
    (STM32_ADCDACSEL    == STM32_ADCDACSEL_MSIK)    ||                      \
    (STM32_ADF1SEL      == STM32_ADF1SEL_MSIK)      ||                      \
    (STM32_FDCAN1SEL    == STM32_FDCAN1SEL_MSIK)    ||                      \
    (STM32_ICLKSEL      == STM32_ICLKSEL_MSIK)      ||                      \
    (STM32_OCTOSPISEL   == STM32_OCTOSPISEL_MSIK)   ||                      \
    (STM32_RNGSEL       == STM32_RNGSEL_MSIK)      ||                      \
    (STM32_SAI1SEL      == STM32_SAI1SEL_MSIK)      ||                      \
    defined(__DOXYGEN__)
  /**
   * @brief   PLL2 activation flag.
   */
  #define STM32_ACTIVATE_MSIK       TRUE
#else

  #define STM32_ACTIVATE_MSIK       FALSE
#endif

/*
 * LSI related checks.
 */
#if STM32_LSI_ENABLED
#else /* !STM32_LSI_ENABLED */

  #if STM32_MCO2SEL == STM32_MCO2SEL_LSI
    #error "LSI not enabled, required by STM32_MCO2SEL"
  #endif

  #if (STM32_LPTIM1SEL == STM32_LPTIM1SEL_LSI)
    #error "LSI not enabled, required by STM32_LPTIM1SEL"
  #endif
  #if (STM32_LPTIM2SEL == STM32_LPTIM2SEL_LSI)
    #error "LSI not enabled, required by STM32_LPTIM2SEL"
  #endif
  #if (STM32_LPTIM34SEL == STM32_LPTIM34SEL_LSI)
    #error "LSI not enabled, required by STM32_LPTIM34SEL"
  #endif

  #if STM32_SYSTICKSEL == STM32_SYSTICKSEL_LSI
    #error "LSI not enabled, required by STM32_SYSTICKSEL"
  #endif

  #if STM32_RNGSEL == STM32_RNGSEL_LSI
    #error "LSI not enabled, required by STM32_RNGSEL"
  #endif

  #if STM32_DAC1SHSEL == STM32_DAC1SHSEL_LSI
    #error "LSI not enabled, required by STM32_DAC1SHSEL"
  #endif

  #if HAL_USE_RTC && (STM32_RTCSEL == STM32_RTCSEL_LSI)
    #error "LSI not enabled, required by STM32_RTCSEL"
  #endif

  #if STM32_LSCOSEL == STM32_LSCOSEL_LSI
    #error "LSI not enabled, required by STM32_LSCOSEL"
  #endif

#endif /* !STM32_LSI_ENABLED */

/*
 * HSI48 related checks.
 */
#if STM32_HSI48_ENABLED
#else /* !STM32_HSI48_ENABLED */

  #if STM32_MCO1SEL == STM32_MCO1SEL_HSI48
    #error "HSI48 not enabled, required by STM32_MCO1SEL"
  #endif

  #if STM32_MCO2SEL == STM32_MCO2SEL_HSI48
    #error "HSI48 not enabled, required by STM32_MCO2SEL"
  #endif

  #if STM32_ICLKSEL == STM32_ICLKSEL_HSI48
    #error "HSI48 not enabled, required by STM32_ICLKSEL"
  #endif

  #if STM32_RNGSEL == STM32_RNGSEL_HSI48
    #error "HSI48 not enabled, required by STM32_RNGSEL"
  #endif

  /* TODO: Check on CRS IP.*/

#endif /* !STM32_HSI48_ENABLED */

/*
 * HSI related checks.
 */
#if STM32_HSI_ENABLED
#else /* !STM32_HSI_ENABLED */

  #if STM32_SW == STM32_SW_HSI16
    #error "HSI not enabled, required by STM32_SW"
  #endif

  #if STM32_MCO1SEL == STM32_MCO1SEL_HSI16
    #error "HSI not enabled, required by STM32_MCO1SEL"
  #endif

  #if STM32_MCO2SEL == STM32_MCO2SEL_HSI16
    #error "HSI not enabled, required by STM32_MCO2SEL"
  #endif

  #if (STM32_USART1SEL == STM32_USART1SEL_HSI16)
    #error "HSI not enabled, required by STM32_USART1SEL"
  #endif
  #if (STM32_USART3SEL == STM32_USART3SEL_HSI16)
    #error "HSI not enabled, required by STM32_USART3SEL"
  #endif
  #if (STM32_UART4SEL == STM32_UART4SEL_HSI16)
    #error "HSI not enabled, required by STM32_UART4SEL"
  #endif
  #if (STM32_UART5SEL == STM32_UART5SEL_HSI16)
    #error "HSI not enabled, required by STM32_UART5SEL"
  #endif
  #if (STM32_LPUART1SEL == STM32_LPUART1SEL_HSI16)
    #error "HSI not enabled, required by STM32_LPUART1SEL"
  #endif

  #if (STM32_LPTIM1SEL == STM32_LPTIM1SEL_HSI16)
    #error "HSI not enabled, required by STM32_LPTIM1SEL"
  #endif
  #if (STM32_LPTIM2SEL == STM32_LPTIM2SEL_HSI16)
    #error "HSI not enabled, required by STM32_LPTIM2SEL"
  #endif
  #if (STM32_LPTIM34SEL == STM32_LPTIM34SEL_HSI16)
    #error "HSI not enabled, required by STM32_LPTIM34SEL"
  #endif

