ChibiOS/ChibiOS/os/hal/ports/STM32/STM32U3xx/hal_lld.h
#endif /* !STM32_HSI_ENABLED */

/*
 * LSE related checks.
 */
#if STM32_LSE_ENABLED
#else /* !STM32_LSE_ENABLED */

  #if STM32_MSIRC0_MODE == STM32_MSIRC0_PLL_LSE
    #error "LSE not enabled, required by STM32_MSIRC0_MODE"
  #endif

  #if STM32_MSIRC1_MODE == STM32_MSIRC1_PLL_LSE
    #error "LSE not enabled, required by STM32_MSIRC1_MODE"
  #endif

  #if STM32_MCO1SEL == STM32_MCO1SEL_LSE
    #error "LSE not enabled, required by STM32_MCO1SEL"
  #endif

  #if STM32_MCO2SEL == STM32_MCO2SEL_LSE
    #error "LSE not enabled, required by STM32_MCO1SEL"
  #endif

  #if (STM32_LPUART1SEL == STM32_LPUART1SEL_LSE)
    #error "LSE not enabled, required by STM32_LPUART1SEL"
  #endif

  #if (STM32_LPTIM1SEL == STM32_LPTIM1SEL_LSE)
    #error "LSE not enabled, required by STM32_LPTIM1SEL"
  #endif
  #if (STM32_LPTIM2SEL == STM32_LPTIM2SEL_LSE)
    #error "LSE not enabled, required by STM32_LPTIM2SEL"
  #endif
  #if (STM32_LPTIM34SEL == STM32_LPTIM34SEL_LSE)
    #error "LSE not enabled, required by STM32_LPTIM34SEL"
  #endif

  #if STM32_SYSTICKSEL == STM32_SYSTICKSEL_LSE
    #error "LSE not enabled, required by STM32_SYSTICKSEL"
  #endif

  #if STM32_DAC1SHSEL == STM32_DAC1SHSEL_LSE
    #error "LSE not enabled, required by STM32_DACSELSH"
  #endif

  #if STM32_RTCSEL == STM32_RTCSEL_LSE
    #error "LSE not enabled, required by STM32_RTCSEL"
  #endif

  #if STM32_LSCOSEL == STM32_LSCOSEL_LSE
    #error "LSE not enabled, required by STM32_LSCOSEL"
  #endif

#endif /* !STM32_LSE_ENABLED */

/*
 * HSE related checks.
 */
#if STM32_HSE_ENABLED
#else /* !STM32_HSE_ENABLED */

  #if STM32_MSIRC0_MODE == STM32_MSIRC0_PLL_HSEDIV1
    #error "HSE not enabled, required by STM32_MSIRC0_MODE"
  #endif

  #if STM32_MSIRC1_MODE == STM32_MSIRC1_PLL_HSEDIV1
    #error "HSE not enabled, required by STM32_MSIRC1_MODE"
  #endif

  #if STM32_SW == STM32_SW_HSE
    #error "HSE not enabled, required by STM32_SW"
  #endif

  #if STM32_MCO1SEL == STM32_MCO1SEL_HSE
    #error "HSE not enabled, required by STM32_MCO1SEL"
  #endif

  #if STM32_MCO2SEL == STM32_MCO2SEL_HSE
    #error "HSE not enabled, required by STM32_MCO2SEL"
  #endif

  #if STM32_ADCDACSEL == STM32_ADCDACSEL_HSE
    #error "HSE not enabled, required by STM32_ADCDACSEL"
  #endif

  #if STM32_SAI1SEL == STM32_SAI1SEL_HSE
    #error "HSE not enabled, required by STM32_SAI1SEL"
  #endif

  #if STM32_RTCSEL == STM32_RTCSEL_HSEDIV
    #error "HSE not enabled, required by STM32_RTCSEL"
  #endif

  #if STM32_ICLKSEL == STM32_ICLKSEL_HSE
    #error "HSE not enabled, required by STM32_ICLKSEL"
  #endif

#endif /* !STM32_HSE_ENABLED */

/**
 * @brief   PLL input divider selection based on HSE frequency.
 */
#if (STM32_MSIRC0_MODE == STM32_MSIRC0_PLL_HSE) ||                          \
    (STM32_MSIRC1_MODE == STM32_MSIRC1_PLL_HSE) || defined(__DOXYGEN__)
  #if STM32_HSECLK == 32000000 || defined(__DOXYGEN__)
    #define STM32_MSIHSINDIV        RCC_ICSCR1_MSIHSINDIV
  #elif STM32_HSECLK == 16000000
    #define STM32_MSIHSINDIV        0U
  #else
    #error "MSIPLL feature requires a 16 or 32 MHz HSE clock"
  #endif
#endif

/**
 * @brief   MSIRC0 mode selection.
 */
#if (STM32_MSIRC0_MODE == STM32_MSIRC0_FREE) || defined(__DOXYGEN__)
  #define STM32_MSIPLL0EN           0U
  #define STM32_MSIPLL0SEL          0U

#elif STM32_MSIRC0_MODE == STM32_MSIRC0_PLL_LSE
  #define STM32_MSIPLL0EN           RCC_CR_MSIPLL0EN
  #define STM32_MSIPLL0SEL          0U

#elif STM32_MSIRC0_MODE == STM32_MSIRC0_PLL_HSE
  #define STM32_MSIPLL0EN           RCC_CR_MSIPLL0EN
  #define STM32_MSIPLL0SEL          RCC_ICSCR1_MSIPLL0SEL

#else
  #error "invalid STM32_MSIRC0_MODE value specified"
#endif

/**
 * @brief   MSIRC1 mode selection.
 */
#if (STM32_MSIRC1_MODE == STM32_MSIRC1_FREE) || defined(__DOXYGEN__)
  #define STM32_MSIPLL1EN           0U
  #define STM32_MSIPLL1SEL          0U

#elif STM32_MSIRC1_MODE == STM32_MSIRC0_PLL_LSE
  #define STM32_MSIPLL1EN           RCC_CR_MSIPLL0EN
  #define STM32_MSIPLL1SEL          0U

#elif STM32_MSIRC1_MODE == STM32_MSIRC0_PLL_HSE
  #define STM32_MSIPLL1EN           RCC_CR_MSIPLL0EN
  #define STM32_MSIPLL1SEL          RCC_ICSCR1_MSIPLL0SEL

#else
  #error "invalid STM32_MSIRC1_MODE value specified"
#endif


/**
 * @brief   MSIRC1 PLL correction factors.
 * @details Valid values are 0, 2 and 3 which correspond to slightly
 *          different frequencies when MSIRC1 is used as source, frequencies
 *          are in MHz:
 *          - 0 LSE: 23.986, 11.993, 5.997, 2.998.
 *          - 2 LSE: 22.577, 11.289, 5.644, 2.822.
 *          - 3 LSE: 24.576, 12.288, 6.144, 3.072.
 *          - 0 HSE: 24.016, 12.008, 6.004, 3.002.
 *          - 2 HSE: 22.581, 11.290, 5.645, 2.823.
 *          - 3 HSE: 24.577, 12.289, 6.144, 3.072.
 *          .
 * @note    MSIRC1 does not allow for round numbers, source from MSIRC0 to
 *          obtain precise 96MHz, 48MHz, 24MHz, 12MHz frequencies.
 */
#if !defined(STM32_MSIPLL1N_VALUE) || defined(__DOXYGEN__)
#define STM32_MSIPLL1N_VALUE                0
#endif

/**
 * @brief   Source and divide factor for MSIS.
 */
#if !defined(STM32_MSIS_SRCDIV) || defined(__DOXYGEN__)
#define STM32_MSIS_SRCDIV                   STM32_MSIS_IRC0_DIV1
#endif

/**
 * @brief   Source and divide factor for MSIK.
 */
#if !defined(STM32_MSIK_SRCDIV) || defined(__DOXYGEN__)
#define STM32_MSIK_SRCDIV                   STM32_MSIK_IRC0_DIV1
#endif

#if (STM32_MSIPLL0EN == 0) || defined(__DOXYGEN__)
  /**
   * @brief   MSIPLL1N field initializer.
   */
  #define STM32_MSIPLL1N            0U

  /**
   * @brief   MSIRC0 base frequency.
   */
  #define STM32_MSIRC0CLK           96000000U

  /**
   * @brief   MSIRC1 base frequency.
   */
  #define STM32_MSIRC1CLK           24000000U

#else
  #if STM32_MSIPLL1N_VALUE == 0
    #define STM32_MSIPLL1N          0U
    #if STM32_MSIPLL1SEL == 0
      #define STM32_MSIRC0CLK       96010000U
      #define STM32_MSIRC1CLK       23986000U
    #else
      #define STM32_MSIRC0CLK       96000000U
      #define STM32_MSIRC1CLK       24016000U
    #endif

  #elif STM32_MSIPLL1N_VALUE == 2
    #define STM32_MSIPLL1N          (RCC_ICSCR1_MSIPLL1N_1)
    #if STM32_MSIPLL1SEL == 0
      #define STM32_MSIRC0CLK       96010000U
      #define STM32_MSIRC1CLK       22577000U
    #else
      #define STM32_MSIRC0CLK       96000000U
      #define STM32_MSIRC1CLK       22581000U
    #endif

  #elif STM32_MSIPLL1N_VALUE == 3
    #define STM32_MSIPLL1N          (RCC_ICSCR1_MSIPLL1N_1 | RCC_ICSCR1_MSIPLL1N_0)
    #if STM32_MSIPLL1SEL == 0
      #define STM32_MSIRC0CLK       96010000U
      #define STM32_MSIRC1CLK       24576000U
    #else
      #define STM32_MSIRC0CLK       96000000U
      #define STM32_MSIRC1CLK       24577000U
    #endif

  #else
    #error "invalid STM32_MSIPLL1N_VALUE value specified"
  #endif
#endif

/**
 * @brief   MSIS clock frequency.
 */
#if (STM32_MSIS_SRCDIV == STM32_MSIS_IRC0_DIV1) || defined(__DOXYGEN__)
#define STM32_MSISCLK               STM32_MSIRC0CLK

#elif STM32_MSIS_SRCDIV == STM32_MSIS_IRC0_DIV2
#define STM32_MSISCLK               (STM32_MSIRC0CLK / 2U)

#elif STM32_MSIS_SRCDIV == STM32_MSIS_IRC0_DIV4
#define STM32_MSISCLK               (STM32_MSIRC0CLK / 4U)

#elif STM32_MSIS_SRCDIV == STM32_MSIS_IRC0_DIV8
#define STM32_MSISCLK               (STM32_MSIRC0CLK / 8U)

