ChibiOS/ChibiOS/os/hal/ports/STM32/STM32U3xx/hal_lld.h
/* Inclusion of PLL-related checks and calculations.*/
#include <stm32_pll1.inc>
#include <stm32_pll2.inc>
#include <stm32_pll3.inc>

/**
 * @brief   System clock source.
 */
#if (STM32_SW == STM32_SW_HSI) || defined(__DOXYGEN__)
  #define STM32_SYSCLK              STM32_HSICLK

#elif STM32_SW == STM32_SW_CSI
  #define STM32_SYSCLK              STM32_CSICLK

#elif STM32_SW == STM32_SW_HSE
  #define STM32_SYSCLK              STM32_HSECLK

#elif STM32_SW == STM32_SW_PLL1P
  #define STM32_SYSCLK              STM32_PLL1_P_CLKOUT

#else
  #error "invalid STM32_SW value specified"
#endif

/* Bus handlers.*/
#include "stm32_ahb.inc"
#include "stm32_apb1.inc"
#include "stm32_apb2.inc"
#include "stm32_apb3.inc"

/**
 * @brief   STOPWUCK source clock.
 */
#if (STM32_STOPWUCK == STM32_STOPWUCK_HSI) || defined(__DOXYGEN__)

#elif STM32_STOPWUCK == STM32_STOPWUCK_CSI

#else
  #error "invalid STM32_STOPWUCK value specified"
#endif

/**
 * @brief   STOPKERWUCK source clock.
 */
#if (STM32_STOPKERWUCK == STM32_STOPKERWUCK_HSI) || defined(__DOXYGEN__)

#elif STM32_STOPKERWUCK == STM32_STOPKERWUCK_CSI

#else
  #error "invalid STM32_STOPKERWUCK value specified"
#endif

/**
 * @brief   RTCPRE clock frequency.
 */
#if (STM32_RTCPRE_VALUE == STM32_RTCPRE_NOCLOCK) || defined(__DOXYGEN__)
  #define STM32_RTCPRECLK           0U

#elif (STM32_RTCPRE_VALUE >= 2) && (STM32_RTCPRE_VALUE <= 63)
  #define STM32_RTCPRECLK           (STM32_HSECLK / STM32_RTCPRE_VALUE)

#else
  #error "invalid STM32_RTCPRECLK_VALUE value specified"
#endif

/**
 * @brief   RTCPRE field.
 */
#define STM32_RTCPRE                STM32_RTCPRE_FIELD(STM32_RTCPRE_VALUE)

/**
 * @brief   MCO1 source clock.
 */
#if (STM32_MCO1SEL == STM32_MCO1SEL_HSI) || defined(__DOXYGEN__)
  #define STM32_MCO1DIVCLK          STM32_HSICLK

#elif STM32_MCO1SEL == STM32_MCO1SEL_LSE
  #define STM32_MCO1DIVCLK          STM32_LSECLK

#elif STM32_MCO1SEL == STM32_MCO1SEL_HSI
  #define STM32_MCO1DIVCLK          STM32_HSICLK

#elif STM32_MCO1SEL == STM32_MCO1SEL_HSE
  #define STM32_MCO1DIVCLK          STM32_HSECLK

#elif STM32_MCO1SEL == STM32_MCO1SEL_PLL1P
  #define STM32_MCO1DIVCLK          STM32_PLL1_P_CLKOUT

#elif STM32_MCO1SEL == STM32_MCO1SEL_HSI48
  #define STM32_MCO1DIVCLK          STM32_HSI48CLK

#else
  #error "invalid STM32_MCO1SEL value specified"
#endif

/**
 * @brief   MCO1 output pin clock frequency.
 */
#if (STM32_MCO1PRE_VALUE == STM32_MCO1PRE_NOCLOCK) || defined(__DOXYGEN__)
  #define STM32_MCO1CLK             0U

#elif (STM32_MCO1PRE_VALUE > STM32_MCO1PRE_NOCLOCK) &&                      \
      (STM32_MCO1PRE_VALUE <= 15)
  #define STM32_MCO1CLK             (STM32_MCO1DIVCLK / STM32_MCO1PRE_VALUE)

#else
#error "invalid STM32_MCO1PRE_VALUE value specified"
#endif

/**
 * @brief   MCO1PRE field.
 */
#define STM32_MCO1PRE               STM32_MCO1PRE_FIELD(STM32_MCO1PRE_VALUE)

/**
 * @brief   MCO2 source clock.
 */
#if (STM32_MCO2SEL == STM32_MCO2SEL_SYSCLK) || defined(__DOXYGEN__)
  #define STM32_MCO2DIVCLK          STM32_SYSCLK

#elif STM32_MCO2SEL == STM32_MCO2SEL_PLL2P
  #define STM32_MCO2DIVCLK          STM32_PLL2_P_CLKOUT

#elif STM32_MCO2SEL == STM32_MCO2SEL_HSE
  #define STM32_MCO2DIVCLK          STM32_HSECLK

#elif STM32_MCO2SEL == STM32_MCO2SEL_PLL1P
  #define STM32_MCO2DIVCLK          STM32_PLL1_P_CLKOUT

#elif STM32_MCO2SEL == STM32_MCO2SEL_CSI
  #define STM32_MCO2DIVCLK          STM32_CSICLK

#elif STM32_MCO2SEL == STM32_MCO2SEL_LSI
  #define STM32_MCO2DIVCLK          STM32_LSICLK

#else
  #error "invalid STM32_MCO2SEL value specified"
#endif

/**
 * @brief   MCO2 output pin clock frequency.
 */
#if (STM32_MCO2PRE_VALUE == STM32_MCO2PRE_NOCLOCK) || defined(__DOXYGEN__)
  #define STM32_MCO2CLK             0U

#elif (STM32_MCO2PRE_VALUE > STM32_MCO2PRE_NOCLOCK) &&                      \
      (STM32_MCO2PRE_VALUE <= 15)
  #define STM32_MCO2CLK             (STM32_MCO2DIVCLK / STM32_MCO2PRE_VALUE)

#else
#error "invalid STM32_MCO2PRE_VALUE value specified"
#endif

/**
 * @brief   MCO2PRE field.
 */
#define STM32_MCO2PRE               STM32_MCO2PRE_FIELD(STM32_MCO2PRE_VALUE)

/**
 * @brief   RTC clock frequency.
 */
#if (STM32_RTCSEL == STM32_RTCSEL_NOCLOCK) || defined(__DOXYGEN__)
  #define STM32_RTCCLK              0U

#elif STM32_RTCSEL == STM32_RTCSEL_LSE
  #define STM32_RTCCLK              STM32_LSECLK

#elif STM32_RTCSEL == STM32_RTCSEL_LSI
  #define STM32_RTCCLK              STM32_LSICLK

#elif STM32_RTCSEL == STM32_RTCSEL_HSEDIV
  #define STM32_RTCCLK              STM32_RTCPRECLK

#else
  #error "invalid STM32_RTCSEL value specified"
#endif

/**
 * @brief   LSCO clock frequency.
 */
#if (STM32_LSCOSEL == STM32_LSCOSEL_NOCLOCK) || defined(__DOXYGEN__)
  #define STM32_LSCOCLK             0U

#elif STM32_LSCOSEL == STM32_LSCOSEL_LSI
  #define STM32_LSCOCLK             STM32_LSICLK

#elif STM32_LSCOSEL == STM32_LSCOSEL_LSE
  #define STM32_LSCOCLK             STM32_LSECLK

#else
  #error "invalid STM32_LSCOSEL value specified"
#endif

/**
 * @brief   USART1 clock frequency.
 */
#if (STM32_USART1SEL == STM32_USART1SEL_PCLK2) || defined(__DOXYGEN__)
  #define STM32_USART1CLK           hal_lld_get_clock_point(CLK_PCLK2)

#elif STM32_USART1SEL == STM32_USART1SEL_PLL2Q
  #define STM32_USART1CLK           hal_lld_get_clock_point(CLK_PLL2QCLK)

#elif STM32_USART1SEL == STM32_USART1SEL_PLL3Q
  #define STM32_USART1CLK           hal_lld_get_clock_point(CLK_PLL3QCLK)

#elif STM32_USART1SEL == STM32_USART1SEL_HSI
  #define STM32_USART1CLK           STM32_HSICLK

#elif STM32_USART1SEL == STM32_USART1SEL_CSI
  #define STM32_USART1CLK           STM32_CSICLK

#elif STM32_USART1SEL == STM32_USART1SEL_LSE
  #define STM32_USART1CLK           STM32_LSECLK

#else
  #error "invalid source selected for USART1 clock"
#endif

/**
 * @brief   USART2 clock frequency.
 */
#if (STM32_USART2SEL == STM32_USART2SEL_PCLK1) || defined(__DOXYGEN__)
  #define STM32_USART2CLK           hal_lld_get_clock_point(CLK_PCLK1)

#elif STM32_USART2SEL == STM32_USART2SEL_PLL2Q
  #define STM32_USART2CLK           hal_lld_get_clock_point(CLK_PLL2QCLK)

#elif STM32_USART2SEL == STM32_USART2SEL_PLL3Q
  #define STM32_USART2CLK           hal_lld_get_clock_point(CLK_PLL3QCLK)

#elif STM32_USART2SEL == STM32_USART2SEL_HSI
  #define STM32_USART2CLK           STM32_HSICLK

