ChibiOS/ChibiOS/os/hal/ports/STM32/STM32U3xx/hal_lld.h
#elif STM32_USART2SEL == STM32_USART2SEL_CSI
  #define STM32_USART2CLK           STM32_CSICLK

#elif STM32_USART2SEL == STM32_USART2SEL_LSE
  #define STM32_USART2CLK           STM32_LSECLK

#else
  #error "invalid source selected for USART2 clock"
#endif

/**
 * @brief   USART3 clock frequency.
 */
#if (STM32_USART3SEL == STM32_USART3SEL_PCLK1) || defined(__DOXYGEN__)
  #define STM32_USART3CLK           hal_lld_get_clock_point(CLK_PCLK1)

#elif STM32_USART3SEL == STM32_USART3SEL_PLL2Q
  #define STM32_USART3CLK           hal_lld_get_clock_point(CLK_PLL2QCLK)

#elif STM32_USART3SEL == STM32_USART3SEL_PLL3Q
  #define STM32_USART3CLK           hal_lld_get_clock_point(CLK_PLL3QCLK)

#elif STM32_USART3SEL == STM32_USART3SEL_HSI
  #define STM32_USART3CLK           STM32_HSICLK

#elif STM32_USART3SEL == STM32_USART3SEL_CSI
  #define STM32_USART3CLK           STM32_CSICLK

#elif STM32_USART3SEL == STM32_USART3SEL_LSE
  #define STM32_USART3CLK           STM32_LSECLK

#else
  #error "invalid source selected for USART3 clock"
#endif

/**
 * @brief   UART4 clock frequency.
 */
#if (STM32_UART4SEL == STM32_UART4SEL_PCLK1) || defined(__DOXYGEN__)
  #define STM32_UART4CLK            hal_lld_get_clock_point(CLK_PCLK1)

#elif STM32_UART4SEL == STM32_UART4SEL_PLL2Q
  #define STM32_UART4CLK            hal_lld_get_clock_point(CLK_PLL2QCLK)

#elif STM32_UART4SEL == STM32_UART4SEL_PLL3Q
  #define STM32_UART4CLK            hal_lld_get_clock_point(CLK_PLL3QCLK)

#elif STM32_UART4SEL == STM32_UART4SEL_HSI
  #define STM32_UART4CLK            STM32_HSICLK

#elif STM32_UART4SEL == STM32_UART4SEL_CSI
  #define STM32_UART4CLK            STM32_CSICLK

#elif STM32_UART4SEL == STM32_UART4SEL_LSE
  #define STM32_UART4CLK            STM32_LSECLK

#else
  #error "invalid source selected for UART4 clock"
#endif

/**
 * @brief   UART5 clock frequency.
 */
#if (STM32_UART5SEL == STM32_UART5SEL_PCLK1) || defined(__DOXYGEN__)
  #define STM32_UART5CLK            hal_lld_get_clock_point(CLK_PCLK1)

#elif STM32_UART5SEL == STM32_UART5SEL_PLL2Q
  #define STM32_UART5CLK            hal_lld_get_clock_point(CLK_PLL2QCLK)

#elif STM32_UART5SEL == STM32_UART5SEL_PLL3Q
  #define STM32_UART5CLK            hal_lld_get_clock_point(CLK_PLL3QCLK)

#elif STM32_UART5SEL == STM32_UART5SEL_HSI
  #define STM32_UART5CLK            STM32_HSICLK

#elif STM32_UART5SEL == STM32_UART5SEL_CSI
  #define STM32_UART5CLK            STM32_CSICLK

#elif STM32_UART5SEL == STM32_UART5SEL_LSE
  #define STM32_UART5CLK            STM32_LSECLK

#else
  #error "invalid source selected for UART5 clock"
#endif

/**
 * @brief   USART6 clock frequency.
 */
#if (STM32_USART6SEL == STM32_USART6SEL_PCLK1) || defined(__DOXYGEN__)
  #define STM32_USART6CLK           hal_lld_get_clock_point(CLK_PCLK1)

#elif STM32_USART6SEL == STM32_USART6SEL_PLL2Q
  #define STM32_USART6CLK           hal_lld_get_clock_point(CLK_PLL2QCLK)

#elif STM32_USART6SEL == STM32_USART6SEL_PLL3Q
  #define STM32_USART6CLK           hal_lld_get_clock_point(CLK_PLL3QCLK)

#elif STM32_USART6SEL == STM32_USART6SEL_HSI
  #define STM32_USART6CLK           STM32_HSICLK

#elif STM32_USART6SEL == STM32_USART6SEL_CSI
  #define STM32_USART6CLK           STM32_CSICLK

#elif STM32_USART6SEL == STM32_USART6SEL_LSE
  #define STM32_USART6CLK           STM32_LSECLK

#else
  #error "invalid source selected for USART6 clock"
#endif

/**
 * @brief   UART7 clock frequency.
 */
#if (STM32_UART7SEL == STM32_UART7SEL_PCLK1) || defined(__DOXYGEN__)
  #define STM32_UART7CLK            hal_lld_get_clock_point(CLK_PCLK1)

#elif STM32_UART7SEL == STM32_UART7SEL_PLL2Q
  #define STM32_UART7CLK            hal_lld_get_clock_point(CLK_PLL2QCLK)

#elif STM32_UART7SEL == STM32_UART7SEL_PLL3Q
  #define STM32_UART7CLK            hal_lld_get_clock_point(CLK_PLL3QCLK)

#elif STM32_UART7SEL == STM32_UART7SEL_HSI
  #define STM32_UART7CLK            STM32_HSICLK

#elif STM32_UART7SEL == STM32_UART7SEL_CSI
  #define STM32_UART7CLK            STM32_CSICLK

#elif STM32_UART7SEL == STM32_UART7SEL_LSE
  #define STM32_UART7CLK            STM32_LSECLK

#else
  #error "invalid source selected for UART7 clock"
#endif

/**
 * @brief   UART8 clock frequency.
 */
#if (STM32_UART8SEL == STM32_UART8SEL_PCLK1) || defined(__DOXYGEN__)
  #define STM32_UART8CLK            hal_lld_get_clock_point(CLK_PCLK1)

#elif STM32_UART8SEL == STM32_UART8SEL_PLL2Q
  #define STM32_UART8CLK            hal_lld_get_clock_point(CLK_PLL2QCLK)

#elif STM32_UART8SEL == STM32_UART8SEL_PLL3Q
  #define STM32_UART8CLK            hal_lld_get_clock_point(CLK_PLL3QCLK)

#elif STM32_UART8SEL == STM32_UART8SEL_HSI
  #define STM32_UART8CLK            STM32_HSICLK

#elif STM32_UART8SEL == STM32_UART8SEL_CSI
  #define STM32_UART8CLK            STM32_CSICLK

#elif STM32_UART8SEL == STM32_UART8SEL_LSE
  #define STM32_UART8CLK            STM32_LSECLK

#else
  #error "invalid source selected for UART8 clock"
#endif

/**
 * @brief   UART9 clock frequency.
 */
#if (STM32_UART9SEL == STM32_UART9SEL_PCLK1) || defined(__DOXYGEN__)
  #define STM32_UART9CLK            hal_lld_get_clock_point(CLK_PCLK1)

#elif STM32_UART9SEL == STM32_UART9SEL_PLL2Q
  #define STM32_UART9CLK            hal_lld_get_clock_point(CLK_PLL2QCLK)

#elif STM32_UART9SEL == STM32_UART9SEL_PLL3Q
  #define STM32_UART9CLK            hal_lld_get_clock_point(CLK_PLL3QCLK)

#elif STM32_UART9SEL == STM32_UART9SEL_HSI
  #define STM32_UART9CLK            STM32_HSICLK

#elif STM32_UART9SEL == STM32_UART9SEL_CSI
  #define STM32_UART9CLK            STM32_CSICLK

#elif STM32_UART9SEL == STM32_UART9SEL_LSE
  #define STM32_UART9CLK            STM32_LSECLK

#else
  #error "invalid source selected for UART9 clock"
#endif

/**
 * @brief   USART10 clock frequency.
 */
#if (STM32_USART10SEL == STM32_USART10SEL_PCLK1) || defined(__DOXYGEN__)
  #define STM32_USART10CLK          hal_lld_get_clock_point(CLK_PCLK1)

#elif STM32_USART10SEL == STM32_USART10SEL_PLL2Q
  #define STM32_USART10CLK          hal_lld_get_clock_point(CLK_PLL2QCLK)

#elif STM32_USART10SEL == STM32_USART10SEL_PLL3Q
  #define STM32_USART10CLK          hal_lld_get_clock_point(CLK_PLL3QCLK)

#elif STM32_USART10SEL == STM32_USART10SEL_HSI
  #define STM32_USART10CLK          STM32_HSICLK

#elif STM32_USART10SEL == STM32_USART10SEL_CSI
  #define STM32_USART10CLK          STM32_CSICLK

