ChibiOS/ChibiOS/os/hal/ports/STM32/STM32U3xx/hal_lld.h
#elif STM32_LPTIM4SEL == STM32_LPTIM4SEL_PER
  #define STM32_LPTIM4CLK           STM32_PERCLK

#else
  #error "invalid source selected for LPTIM4 clock"
#endif

/**
 * @brief   LPTIM5 clock frequency.
 */
#if (STM32_LPTIM5SEL == STM32_LPTIM5SEL_PCLK3) || defined(__DOXYGEN__)
  #define STM32_LPTIM5CLK           hal_lld_get_clock_point(CLK_PCLK3)

#elif STM32_LPTIM5SEL == STM32_LPTIM5SEL_PLL2P
  #define STM32_LPUART1CLK          hal_lld_get_clock_point(CLK_PLL2PCLK)

#elif STM32_LPTIM5SEL == STM32_LPTIM5SEL_PLL3R
  #define STM32_LPUART1CLK          hal_lld_get_clock_point(CLK_PLL3RCLK)

#elif STM32_LPTIM5SEL == STM32_LPTIM5SEL_LSE
  #define STM32_LPTIM5CLK           STM32_LSECLK

#elif STM32_LPTIM5SEL == STM32_LPTIM5SEL_LSI
  #define STM32_LPTIM5CLK           STM32_LSICLK

#elif STM32_LPTIM5SEL == STM32_LPTIM5SEL_PER
  #define STM32_LPTIM5CLK           STM32_PERCLK

#else
  #error "invalid source selected for LPTIM5 clock"
#endif

/**
 * @brief   LPTIM6 clock frequency.
 */
#if (STM32_LPTIM6SEL == STM32_LPTIM6SEL_PCLK3) || defined(__DOXYGEN__)
  #define STM32_LPTIM6CLK           hal_lld_get_clock_point(CLK_PCLK3)

#elif STM32_LPTIM6SEL == STM32_LPTIM6SEL_PLL2P
  #define STM32_LPUART1CLK          hal_lld_get_clock_point(CLK_PLL2PCLK)

#elif STM32_LPTIM6SEL == STM32_LPTIM6SEL_PLL3R
  #define STM32_LPUART1CLK          hal_lld_get_clock_point(CLK_PLL3RCLK)

#elif STM32_LPTIM6SEL == STM32_LPTIM6SEL_LSE
  #define STM32_LPTIM6CLK           STM32_LSECLK

#elif STM32_LPTIM6SEL == STM32_LPTIM6SEL_LSI
  #define STM32_LPTIM6CLK           STM32_LSICLK

#elif STM32_LPTIM6SEL == STM32_LPTIM6SEL_PER
  #define STM32_LPTIM6CLK           STM32_PERCLK

#else
  #error "invalid source selected for LPTIM6 clock"
#endif

/**
 * @brief   SPI1 clock frequency.
 */
#if (STM32_SPI1SEL == STM32_SPI1SEL_PLL1Q) || defined(__DOXYGEN__)
  #define STM32_SPI1CLK             hal_lld_get_clock_point(CLK_PLL1QCLK)

#elif STM32_SPI1SEL == STM32_SPI1SEL_PLL2P
  #define STM32_SPI1CLK             hal_lld_get_clock_point(CLK_PLL2PCLK)

#elif STM32_SPI1SEL == STM32_SPI1SEL_PLL3P
  #define STM32_SPI1CLK             hal_lld_get_clock_point(CLK_PLL3PCLK)

#elif STM32_SPI1SEL == STM32_SPI1SEL_AUDIOCLK
  #define STM32_SPI1CLK             0 /* TODO board.h */

#elif STM32_SPI1SEL == STM32_SPI2SEL_PER
  #define STM32_SPI1CLK             STM32_PERCLK

#else
  #error "invalid source selected for SPI1 clock"
#endif

/**
 * @brief   SPI2 clock frequency.
 */
#if (STM32_SPI2SEL == STM32_SPI2SEL_PLL1Q) || defined(__DOXYGEN__)
  #define STM32_SPI2CLK             hal_lld_get_clock_point(CLK_PLL1QCLK)

#elif STM32_SPI2SEL == STM32_SPI2SEL_PLL2P
  #define STM32_SPI2CLK             hal_lld_get_clock_point(CLK_PLL2PCLK)

#elif STM32_SPI2SEL == STM32_SPI2SEL_PLL3P
  #define STM32_SPI2CLK             hal_lld_get_clock_point(CLK_PLL3PCLK)

#elif STM32_SPI2SEL == STM32_SPI2SEL_AUDIOCLK
  #define STM32_SPI2CLK             0 /* TODO board.h */

#elif STM32_SPI2SEL == STM32_SPI2SEL_PER
  #define STM32_SPI2CLK             STM32_PERCLK

#else
  #error "invalid source selected for SPI2 clock"
#endif

/**
 * @brief   SPI3 clock frequency.
 */
#if (STM32_SPI3SEL == STM32_SPI3SEL_PLL1Q) || defined(__DOXYGEN__)
  #define STM32_SPI3CLK             hal_lld_get_clock_point(CLK_PLL1QCLK)

#elif STM32_SPI3SEL == STM32_SPI3SEL_PLL2P
  #define STM32_SPI3CLK             hal_lld_get_clock_point(CLK_PLL2PCLK)

#elif STM32_SPI3SEL == STM32_SPI3SEL_PLL3P
  #define STM32_SPI3CLK             hal_lld_get_clock_point(CLK_PLL3PCLK)

#elif STM32_SPI3SEL == STM32_SPI3SEL_AUDIOCLK
  #define STM32_SPI3CLK             0 /* TODO board.h */

#elif STM32_SPI3SEL == STM32_SPI2SEL_PER
  #define STM32_SPI3CLK             STM32_PERCLK

#else
  #error "invalid source selected for SPI3 clock"
#endif

/**
 * @brief   SPI4 clock frequency.
 */
#if (STM32_SPI4SEL == STM32_SPI4SEL_PCLK2) || defined(__DOXYGEN__)
  #define STM32_SPI4CLK             hal_lld_get_clock_point(CLK_PCLK2)

#elif STM32_SPI4SEL == STM32_SPI4SEL_PLL2P
  #define STM32_SPI4CLK             hal_lld_get_clock_point(CLK_PLL2PCLK)

#elif STM32_SPI4SEL == STM32_SPI4SEL_PLL3P
  #define STM32_SPI4CLK             hal_lld_get_clock_point(CLK_PLL3PCLK)

#elif STM32_SPI4SEL == STM32_SPI4SEL_HSI
  #define STM32_SPI4CLK             STM32_HSICLK

#elif STM32_SPI4SEL == STM32_SPI4SEL_CSI
  #define STM32_SPI4CLK             STM32_CSICLK

#elif STM32_SPI4SEL == STM32_SPI4SEL_HSE
  #define STM32_SPI4CLK             STM32_HSECLK

#else
  #error "invalid source selected for SPI4 clock"
#endif

/**
 * @brief   SPI5 clock frequency.
 */
#if (STM32_SPI5SEL == STM32_SPI5SEL_PCLK3) || defined(__DOXYGEN__)
  #define STM32_SPI5CLK             hal_lld_get_clock_point(CLK_PCLK3)

#elif STM32_SPI5SEL == STM32_SPI5SEL_PLL2P
  #define STM32_SPI5CLK             hal_lld_get_clock_point(CLK_PLL2PCLK)

#elif STM32_SPI5SEL == STM32_SPI5SEL_PLL3P
  #define STM32_SPI5CLK             hal_lld_get_clock_point(CLK_PLL3PCLK)

#elif STM32_SPI5SEL == STM32_SPI5SEL_HSI
  #define STM32_SPI5CLK             STM32_HSICLK

#elif STM32_SPI5SEL == STM32_SPI5SEL_CSI
  #define STM32_SPI5CLK             STM32_CSICLK

#elif STM32_SPI5SEL == STM32_SPI5SEL_HSE
  #define STM32_SPI5CLK             STM32_HSECLK

#else
  #error "invalid source selected for SPI5 clock"
#endif

/**
 * @brief   SPI6 clock frequency.
 */
#if (STM32_SPI6SEL == STM32_SPI6SEL_PCLK2) || defined(__DOXYGEN__)
  #define STM32_SPI6CLK             hal_lld_get_clock_point(CLK_PCLK2)

#elif STM32_SPI6SEL == STM32_SPI6SEL_PLL2P
  #define STM32_SPI6CLK             hal_lld_get_clock_point(CLK_PLL2PCLK)

#elif STM32_SPI6SEL == STM32_SPI6SEL_PLL3P
  #define STM32_SPI6CLK             hal_lld_get_clock_point(CLK_PLL3PCLK)

#elif STM32_SPI6SEL == STM32_SPI6SEL_HSI
  #define STM32_SPI6CLK             STM32_HSICLK

#elif STM32_SPI6SEL == STM32_SPI6SEL_CSI
  #define STM32_SPI6CLK             STM32_CSICLK

#elif STM32_SPI6SEL == STM32_SPI6SEL_HSE
  #define STM32_SPI6CLK             STM32_HSECLK

#else
  #error "invalid source selected for SPI6 clock"
#endif

/**
 * @brief   OSPI clock frequency.
 */
#if (STM32_OSPISEL == STM32_OSPISEL_HCLK4) || defined(__DOXYGEN__)
  #define STM32_OSPICLK             hal_lld_get_clock_point(CLK_HCLK)

#elif STM32_OSPISEL == STM32_OSPISEL_PLL1Q
  #define STM32_OSPICLK             hal_lld_get_clock_point(CLK_PLL1QCLK)

#elif STM32_OSPISEL == STM32_OSPISEL_PLL2R
  #define STM32_OSPICLK             hal_lld_get_clock_point(CLK_PLL2RCLK)

#elif STM32_OSPISEL == STM32_OSPISEL_PER
  #define STM32_OSPICLK             STM32_PERCLK

#else
  #error "invalid source selected for OSPI clock"
#endif

/**
 * @brief   SYSTICK clock frequency.
 */
#if (STM32_SYSTICKSEL == STM32_SYSTICKSEL_HCLKDIV8) || defined(__DOXYGEN__)
  #define STM32_SYSTICKCLK          (hal_lld_get_clock_point(CLK_HCLK) / 8)

#elif STM32_SYSTICKSEL == STM32_SYSTICKSEL_LSI
  #define STM32_SYSTICKCLK          STM32_LSICLK

#elif STM32_SYSTICKSEL == STM32_SYSTICKSEL_LSE
  #define STM32_SYSTICKCLK          STM32_LSECLK

