ChibiOS/ChibiOS/os/hal/ports/STM32/STM32U3xx/hal_lld.h
#elif STM32_SYSTICKSEL == STM32_SYSTICKSEL_NOCLOCK
  #define STM32_SYSTICKCLK          0

#else
  #error "invalid source selected for STM32_SYSTICKSEL clock"
#endif

/**
 * @brief   USB clock frequency.
 */
#if (STM32_USBSEL == STM32_USBSEL_NOCLOCK) || defined(__DOXYGEN__)
  #define STM32_USBCLK              0

#elif STM32_USBSEL == STM32_USBSEL_PLL1Q
  #define STM32_USBCLK              hal_lld_get_clock_point(CLK_PLL1QCLK)

#elif STM32_USBSEL == STM32_USBSEL_PLL3Q
  #define STM32_USBCLK              hal_lld_get_clock_point(CLK_PLL3QCLK)

#elif STM32_USBSEL == STM32_USBSEL_HSI48
  #define STM32_USBCLK              STM32_HSI48CLK

#else
  #error "invalid source selected for USB clock"
#endif

/**
 * @brief   SDMMC1 clock frequency.
 */
#if (STM32_SDMMC1SEL == STM32_SDMMC1SEL_PLL1Q) || defined(__DOXYGEN__)
  #define STM32_SDMMC1CLK           hal_lld_get_clock_point(CLK_PLL1QCLK)

#elif STM32_SDMMC1SEL == STM32_SDMMC1SEL_PLL2R
  #define STM32_SDMMC1CLK           hal_lld_get_clock_point(CLK_PLL2RCLK)

#else
  #error "invalid source selected for SDMMC1 clock"
#endif

/**
 * @brief   SDMMC2 clock frequency.
 */
#if (STM32_SDMMC2SEL == STM32_SDMMC2SEL_PLL1Q) || defined(__DOXYGEN__)
  #define STM32_SDMMC2CLK           hal_lld_get_clock_point(CLK_PLL1QCLK)

#elif STM32_SDMMC2SEL == STM32_SDMMC2SEL_PLL2R
  #define STM32_SDMMC2CLK           hal_lld_get_clock_point(CLK_PLL2RCLK)

#else
  #error "invalid source selected for SDMMC2 clock"
#endif

/**
 * @brief   I2C1 clock frequency.
 */
#if (STM32_I2C1SEL == STM32_I2C1SEL_PCLK1) || defined(__DOXYGEN__)
  #define STM32_I2C1CLK             hal_lld_get_clock_point(CLK_PCLK1)

#elif STM32_I2C1SEL == STM32_I2C1SEL_PLL3R
  #define STM32_I2C1CLK             hal_lld_get_clock_point(CLK_PLL3RCLK)

#elif STM32_I2C1SEL == STM32_I2C1SEL_HSI
  #define STM32_I2C1CLK             STM32_HSICLK

#elif STM32_I2C1SEL == STM32_I2C1SEL_CSI
  #define STM32_I2C1CLK             STM32_CSICLK

#else
  #error "invalid source selected for I2C1 clock"
#endif

/**
 * @brief   I2C2 clock frequency.
 */
#if (STM32_I2C2SEL == STM32_I2C2SEL_PCLK1) || defined(__DOXYGEN__)
  #define STM32_I2C2CLK             hal_lld_get_clock_point(CLK_PCLK1)

#elif STM32_I2C2SEL == STM32_I2C2SEL_PLL3R
  #define STM32_I2C2CLK             hal_lld_get_clock_point(CLK_PLL3RCLK)

#elif STM32_I2C2SEL == STM32_I2C2SEL_HSI
  #define STM32_I2C2CLK             STM32_HSICLK

#elif STM32_I2C2SEL == STM32_I2C2SEL_CSI
  #define STM32_I2C2CLK             STM32_CSICLK

#else
  #error "invalid source selected for I2C2 clock"
#endif

/**
 * @brief   I2C3 clock frequency.
 */
#if (STM32_I2C3SEL == STM32_I2C3SEL_PCLK3) || defined(__DOXYGEN__)
  #define STM32_I2C3CLK             hal_lld_get_clock_point(CLK_PCLK3)

#elif STM32_I2C3SEL == STM32_I2C3SEL_PLL3R
  #define STM32_I2C3CLK             hal_lld_get_clock_point(CLK_PLL3RCLK)

#elif STM32_I2C3SEL == STM32_I2C3SEL_HSI
  #define STM32_I2C3CLK             STM32_HSICLK

#elif STM32_I2C3SEL == STM32_I2C3SEL_CSI
  #define STM32_I2C3CLK             STM32_CSICLK

#else
  #error "invalid source selected for I2C3 clock"
#endif

/**
 * @brief   I2C4 clock frequency.
 */
#if (STM32_I2C4SEL == STM32_I2C4SEL_PCLK3) || defined(__DOXYGEN__)
  #define STM32_I2C4CLK             hal_lld_get_clock_point(CLK_PCLK3)

#elif STM32_I2C4SEL == STM32_I2C4SEL_PLL3R
  #define STM32_I2C4CLK             hal_lld_get_clock_point(CLK_PLL3RCLK)

#elif STM32_I2C4SEL == STM32_I2C4SEL_HSI
  #define STM32_I2C4CLK             STM32_HSICLK

#elif STM32_I2C4SEL == STM32_I2C4SEL_CSI
  #define STM32_I2C4CLK             STM32_CSICLK

#else
  #error "invalid source selected for I2C4 clock"
#endif

/**
 * @brief   I3C1 clock frequency.
 */
#if (STM32_I3C1SEL == STM32_I3C1SEL_PCLK1) || defined(__DOXYGEN__)
  #define STM32_I3C1CLK             hal_lld_get_clock_point(CLK_PCLK1)

#elif STM32_I3C1SEL == STM32_I3C1SEL_PLL3R
  #define STM32_I3C1CLK             hal_lld_get_clock_point(CLK_PLL3RCLK)

#elif STM32_I3C1SEL == STM32_I3C1SEL_HSI
  #define STM32_I3C1CLK             STM32_HSICLK

#else
  #error "invalid source selected for I3C1 clock"
#endif

/**
 * @brief   ADCDACSEL clock frequency.
 */
#if (STM32_ADCDACSEL == STM32_ADCDACSEL_HCLK) || defined(__DOXYGEN__)
  #define STM32_ADCDACCLK           hal_lld_get_clock_point(CLK_HCLK)

#elif STM32_ADCDACSEL == STM32_ADCDACSEL_SYSCLK
  #define STM32_ADCDACCLK           hal_lld_get_clock_point(CLK_SYSCLK)

#elif STM32_ADCDACSEL == STM32_ADCDACSEL_PLL2R
  #define STM32_ADCDACCLK           hal_lld_get_clock_point(CLK_PLL2RCLK)

#elif STM32_ADCDACSEL == STM32_ADCDACSEL_HSE
  #define STM32_ADCDACCLK           STM32_HSECLK

#elif STM32_ADCDACSEL == STM32_ADCDACSEL_HSI
  #define STM32_ADCDACCLK           STM32_HSICLK

#elif STM32_ADCDACSEL == STM32_ADCDACSEL_CSI
  #define STM32_ADCDACCLK           STM32_CSICLK

#else
  #error "invalid source selected for ADCDACSEL clock"
#endif

/**
 * @brief   DACSEL clock frequency.
 */
#if (STM32_DACSEL == STM32_DACSEL_LSI) || defined(__DOXYGEN__)
  #define STM32_DACSELCLK           STM32_LSICLK

#elif STM32_DACSEL == STM32_DACSEL_LSE
  #define STM32_DACSELCLK           STM32_LSECLK

#elif STM32_DACSEL == STM32_DACSEL_IGNORE
  #define STM32_DACSELCLK           0

#else
  #error "invalid source selected for DACSEL clock"
#endif

/**
 * @brief   RNG clock frequency.
 */
#if (STM32_RNGSEL == STM32_RNGSEL_HSI48) || defined(__DOXYGEN__)
  #define STM32_RNGCLK              STM32_HSI48CLK

#elif STM32_RNGSEL == STM32_RNGSEL_PLL1Q
  #define STM32_RNGCLK              hal_lld_get_clock_point(CLK_PLL1QCLK)

#elif STM32_RNGSEL == STM32_RNGSEL_LSE
  #define STM32_RNGCLK              STM32_LSECLK

#elif STM32_RNGSEL == STM32_RNGSEL_LSI
  #define STM32_RNGCLK              STM32_LSICLK

#elif STM32_RNGSEL == STM32_RNGSEL_IGNORE
  #define STM32_RNGCLK              0

#else
  #error "invalid source selected for RNG clock"
#endif

/**
 * @brief   CEC clock frequency.
 */
#if (STM32_CECSEL == STM32_CECSEL_LSE) || defined(__DOXYGEN__)
  #define STM32_CECCLK              STM32_LSECLK

#elif STM32_CECSEL == STM32_CECSEL_LSI
  #define STM32_CECCLK              STM32_LSICLK

#elif STM32_CECSEL == STM32_CECSEL_CSIDIV128
  #define STM32_CECCLK              (STM32_CSICLK / 128)

#elif STM32_CECSEL == STM32_CECSEL_IGNORE
  #define STM32_CECCLK              0

#else
  #error "invalid source selected for CEC clock"
#endif

/**
 * @brief   FDCAN clock frequency.
 */
#if (STM32_FDCANSEL == STM32_FDCANSEL_HSE) || defined(__DOXYGEN__)
  #define STM32_FDCANCLK            STM32_HSECLK

